{"person":{"1214":{"title":"Wronsky, Siddy (born Neufeld, Sidonie)","fields":{"field_biography":["Siddy Wronsky (née Neufeld) was born on 20.7.1883 in Berlin and died 8.12.1947 in Jerusalem. She embodies the strong link between social work in the Yishuv, the profession’s German roots, and Zionist ideas, as she was a major activist in both the German welfare system and in Palestine. Siddy's father was of German descent while her mother came from Eastern Europe. She started her career as a teacher and later studied special education. Since 1908, Siddy administered the German central welfare archive and was a member of the German Union of Welfare Workers and the 'Zentralwohlfahrtsstelle der Juden in Deutschland' (Central Welfare Bureau for Jews in Germany, ZWST). She was the chief editor of the leading welfare journal and its German-Jewish counterpart (Deutsche Zeitschrift für Wohlfahrtspflege and Jüdische Wohlfahrtspflege und Sozialpolitik, respectively). She also taught in the social women's school Berlin-Schöneberg of Alice Salomon, chaired the Zionist women’s organization and was active on behalf of East-European Jewish refugees. When the Nazis took power in 1933, she was dismissed from the archive and immigrated to Palestine intent on promoting social work in the Yishuv. In Jerusalem, she founded the first social work school, chaired the Center for Out-of-Home Care and the Social-Pedagogical Department of the Jewish National Council, and founded the Social Workers Union. Wronsky was intensely active in promoting social legislation and justice and in enhancing the status of the profession, saying that ‘the public entrusts the social service and social workers with its most valuable asset, the person’. Wronsky believed wholeheartedly that social work was essential for the creation of a national home for Jews in Palestine, as indicated by her essays: The Social Idea in Herzl's Writings (1944), Social Therapy Methods in Eretz Israel (1935) and Social investigation methods on a sociological base (n.d.a). This study relies much on her writings which may be seen as constitutive of contemporary social work, and focuses on two key concepts: social diagnosis and social therapy. "]},"created":"1515393148","changed":"1601551532"},"1215":{"title":"Neufeld, Hertha","fields":{"field_biography":["Hertha Neufeld was born on 14.1.1886 in Berlin and died on 16.1.1975 in London. She was the sister of Siddy Wronsky. In Berlin, where she lived until 1938, she held a leading position (manager) with the \"Jüdische Kinderhilfe e.V.\" (Auguststrasse), that was founded after the end of the First World War to help immigrants from East European countries and their children. It rendered a variety of services, especially in the fields of health and education. Firstly, between 1920-1925, she worked there voluntarily, then she took over the management of the Jüdische Kinderhilfe and became board member. Hertha maintained a day care center and also looked after the health and educational needs of children, many of whom stemmed from Eastern Jewish families. She was responsible for all organizational, cooperational and pedagogical questions and worked together with the 'Zentralwohlfahrtsstelle der Juden in Deutschland (Central welfare bureau of Jews in Germany, ZWST) and the Jewish community of Berlin. In 1938, she immigrated to Palestine, where she lived, and possibly worked, together with her sister Siddy Wronsky. Her activities were mainly devoted to the boarding school for deaf and dumb children in Jerusalem, where she worked as a secretary between 1943-1954 (her work was interrupted by an accident), run under the auspices of the Alliance Israelite Universelle. In 1955, she transferred all of Siddy Wronsky's personal inherent to the Zionist archive in Jerusalem, and at that same year she immigrated to London and spent the years of her retirement there with her brother Dr. Hans Neufeld (an economist). Yet, as long as her health permitted, she also voluntarily worked for the benefit of the former Jewish refugees by building up and administering the lending library run by the AJR (Association of Jewish Refugees). She was a highly regarded as a person who had a decisive share in the expansion and dynamic development of the 'Kinderhilfe'. "]},"created":"1515393361","changed":"1530892765"},"1216":{"title":"Hoffert-Horani, Dr. Mirjam (born Fassbender, Maria)","fields":{"field_biography":["Mirjam Hoffert (married Horani) was born on 13.10.1897 in Jaslo, Poland and died 1980 in Tel-Aviv. In her youth she was a member of the Warsaw branch of “Hashomer Hatzair\". She recounts that this experience, in helping the needy later led her to study psychology and pedagogy at the University of Vienna. She was inspired by the ideas prevalent in social pedagogy at the time, and she chose to write her PhD dissertation on the psychological principles in the work of the Swiss educator Johann Heinrich Pestalozzi. First, she attended the Jewish pedagogical seminar held by Zvi Peretz Chajes. Secondly, she studied psychotherapy at the Freud institute under the instruction of Anna Freud and Siegfried Bernfeld. But Hoffert was restless and returned to Warsaw studying the unique methods of working with orphan children developed by Janusz Korczak. Hoffert's first practical experience was as a pedagogical coordinator at the Jewish orphan house for girls in Vienna. After registering at the Alice Salomon school in 1926, she undertook her internship with drug and alcohol addicts, based on her former training in psychotherapy. After her graduation in 1928, she ran a social club for children with behavioral problems, the Kinderbeobachtungsstation, at the Charité hospital in Berlin. In 1933, soon after the rise of the Nazis and her dismissal, Hoffert emigrated to Palestine. She was sent by Dr Mordechai Brachyahu to treat and diagnose children with behavioral problems in a family clinic, where she applied psychoanalytic ideas. Then, she was invited by Henrietta Szold, the leader of the Hadassah movement and the initiator of social services in the Jewish community in Palestine, to work at the welfare department for German Jews in Tel-Aviv. Later, the department also began to treat immigrants from other non-European countries, such as Yemenite Jews, and was renamed “the social services for the Jewish immigrant” (the Oleh). After the establishment of Israel in 1948, Hoffert was asked to run the department, and was in charge of social work in the Ma'abarot. In 1954 she was one of the founders of the “Aluma Center”, which provided affordable subsidized family therapy for all classes. Mirjam Hoffert continued to support an international perspective, one that sought to exchange knowledge with other countries, even after her settlement in Palestine. In 1947, she took part in missions travelling to aid Holocaust survivors in refugee camps in Cyprus, and in 1952 she was sent by the Ministry of Welfare to the United States to expand her knowledge on the practice of community social work. Between 1953 and 1962 she founded and headed the community social work department in the Ministry of Welfare, and in doing so, introduced new social work approaches within the ministry, while again exchanging knowledge with peers from various countries, such as India.53 In 1961 she headed the Israeli social work school, established in Kenya – “the Kenya-Israel school for rural social workers at Machakos” – a diplomatic project that aimed to strengthen the local population and promote Kenyan independence. After her retirement, Hoffert continued to work on a voluntary basis, consulting the public housing organization “Amidar”, the official worker's union, and elderly care services. Additionally, she established a community theatre project for endangered youth, and in 1978 she was part of the committee which organized the international summit for social work held in Israel. Little is known on her private life, besides that she was married in 1934 to Yaacov Horani, a Zionist pioneer, and that the couple did not have children. Every year, the Mirjam Hoffert Award is given to pioneering and innovative projects by the Israeli Social Work Union."]},"created":"1515393820","changed":"1529139852"},"1219":{"title":"Filene, Dorothy (born Finkelstein, Dorothea (Dora) Henriette)","fields":{"field_biography":["Dorothy Filene (Dorothea Finkelstein) was born on 19.6.1908 in Berlin and died on 17.11.1993 in Jamaica. She was trained as a Kindergarten teacher and a social worker at the social-pedagogical seminary of the 'Verein Jugendheim' Berlin-Charlottenburg of Anna von Gierke. She emigrated in 1933 to Palestine, where she could not find a job as a social worker. She emigrated again in 1935 to the U.S. Dorothy had another training as a social worker at the New York school for social work and worked subsequently in Jewish social work, amongst other things as an American representative in a Displaced Persons Camp in Germany (JOINT). She later worked in a number of other places providing social assistance, such as with the United Service for New Americans, the Children’s Service, and the Jewish Federation of Youngstown, Ohio. "]},"created":"1515395059","changed":"1601551572"},"1221":{"title":"Hochmann, Hanna (born Gerson)","fields":{"field_biography":["Hanna Hochmann (born Gerson) was born on 17.6.1913 in Berlin-Weissensee and died in Israel. Hanna grew up in a liberal, conservative, Jewish, non-Zionist home. In her youth, she was a member of the Jewish youth movement of the Central Verein (close to the 'Kameraden'). Hanna attended the social-pedagogical seminary (Sozialpädagogisches Seminar) of the Verein Jugendheim in Berlin-Charlottenburg and trained as a kindergarten carer\/day-care provider (Kindergärtnerin\/Hortnerin). In 1938, she started her Hachshara for immigration to Palestine. She established a kibbutz and worked with children in Petah Tikva. Hanna was a member of the Mapai Party (the workers' party in Israel) and was involved in educational reforms. In 1972, she volunteered as a mentor for young teachers, kindergarten carers and soldiers working with distressed children, using psychological methods. "]},"created":"1515395565","changed":"1542028160"},"1222":{"title":"Ragolsky, Dr. Sophia (born Illich\/Illch)","fields":{"field_biography":["Dr. Sophia Ragolsky (née Illich\/Illch) was born on 8.1.1909 in Berlin and died on 9.4.1981 in Jerusalem. Her father was a lawyer. She studied medicine but did not graduate. Afterwards, she did her PhD in ‘Nationalökonomie’ in Germany. Later she studied social work at the Verein Jugendheim, Berlin-Charlottenburg (1931–33). She worked in a Jewish orphanage and nursery home in Kreuzberg with Friedrich Ollendorff. Around 1936 she emigrated to Palestine. There, she established and headed the welfare department in Ramataim between 1941 and 1948; As part of her position there, in 1947 she worked at the social welfare office in Magdiel, and later with soldiers' families in Petah Tikva. After 1948 she worked under the supervision of Zipora Bloch, monitoring out-of-home care, foster families and adoption. After her retirement, she helped establish the social welfare department in Eilat while living in Nili Street in Katamon, Jerusalem. Sophia was married in Germany and later divorced after her emigration to Palestine. She had one daughter. "]},"created":"1515395786","changed":"1549406809"},"1257":{"title":"Livneh, Dr. Emmi (Löwenthal, born Strauß)","fields":{"field_biography":["Born 27 May 1902 in Fulda - died 7 November 1953 in Jerusalem. Emmi was a member of the German-Jewish youth movement 'Kameraden' and of the trade union movement. She studied sociology and economics and held leading positions in social work in Frankfurt and Munich. After her immigration to Palestine in 1934, she worked closely with Henrietta Szold mainly in the field of social work with immigrants. Additionally, she visited the United States and studied social work with immigrants there. She founded the Union of Social Workers in Palestine."]},"created":"1524572006","changed":"1525790014"},"1281":{"title":"Gellner, Hedwig","fields":{"field_biography":["Hedwig Gellner was born in 1887 in Žatec (Czech Republic) and died in the late 1980's in Tel-Aviv. Hedwig grew up in a family of nine children. Among her siblings were Julius Gellner (one of the most famous German-speaking theatre directors in the 1920's) and Rudolf Gellner (his son was Ernest André Gellner, who was a British-Czech philosopher and social anthropologist). The Gellner family moved in 1897 to Saaz and in 1910 to Prague, where Hedwig spent the interwar period. At this time, she was a member of the Zionist girl's club and the head organizer of the Zionist office (presumably the representation of the World Zionist Organization or the so-called Palestine Office 'Palästina-Amt' which took care of candidates for Aliyah). In 1919, Hedwig started working with Jewish refugees for the JDC, and during an international welfare conference that took place in Prague she met the heads of the Zionist delegation that influenced her to immigrate to Palestine. In 1921, she accompanied a group of Jewish orphans from Ukraine to their relatives in the US, where she stayed and studied social work. In 1923, Hedwig immigrated to Palestine together with her sister Tony. First, she was appointed by the British mandatory committee for new immigrants to help young Jewish girls to resettle in Palestine. Later, she headed the child care department and later developed and headed the social work department in Tel-Aviv between 1934-1948. She also studied the field of occupational training for women. In 1946, she represented the Zionist leadership in a gerontology conference in London. After 1948 she was appointed as the national coordinator between the youth rehabilitation department and international organizations such as the red cross, UNRA and UNICEF. She was also appointed to head the research department of the ministry of welfare. After her official retirement in 1956 she continued to volunteer with WIZO and with the international organization for social aid. She was affiliated to Mapai Party (the worker's party in Israel)."]},"created":"1524677265","changed":"1527426759"},"1282":{"title":"Senator, David Werner ","fields":{"field_biography":["<p><span><span><span><span><span lang=\"EN-US\"><span>David Werner Senator<\/span><\/span> was born on <span dir=\"RTL\" lang=\"HE\">6.9.1896<\/span> in Berlin, Germany and<strong> <\/strong>died on <span dir=\"RTL\" lang=\"HE\">2.11.1953<\/span> in Atlanta, Georgia, USA. His father was Severin Senator and his mother was Elisheva to the Gotteshelk family. David Senator became interested in the problems of Eretz Israel while he was still a student in Germany and wrote his doctoral thesis on Jewish settlement in that country. He studied at the universities of Munich, Berlin and Freiburg in 1919. He was interested in Jewish culture and art and devoted himself to cultural activities among Jewish youth from Eastern Europe and he joined the circle of the Volksheim. He worked for Jewish welfare organizations in Germany, worked for the European branch of the American Jewish Joint Distribution Committee, rising to the position of General Secretary of its European headquarters. <\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>He was also a leading member of the Brit Shalom and Ihud movements and was a supporter of Judah Magnes' political work advocating a binational state for Jews and Arabs in Palestine. <\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>Senator settled in Palestine in 1924 but was sent on a mission abroad and returned in 1930. He was elected as a member of the Jewish Agency executive board at the plenary session of the Jewish Agency Council in Basle in 1931, and served there until 1935 as Treasurer of the Jewish Agency and later head of the Immigration Department and the Department of Settlement of German Jews. <\/span><\/span><\/span><\/span> <span lang=\"EN-US\">He resigned in 1935, as a result of his opposition to the Agency's \"activist\" policy. He then returned to Palestine and became administrator of the Hebrew University and ran the university during crucial periods in the Second World War and the War of Independence. In 1949, he became the Executive Vice-President of the Hebrew University.<\/span><\/p> "]},"created":"1524677315","changed":"1582893000"},"1284":{"title":"Lotan, Giora (née Lubinski, Georg)","fields":{"field_biography":["<p><span><span><span><span><span lang=\"EN-US\"><span>Giora Lotan<\/span><\/span> (Georg Lubinsky) was born on 22.3.1902 in Berlin, Germany, and died on 1.1.1974 in Jerusalem, Israel. He was the son of Eliezer and Ulrike, and the brother of Hans Lubinski (1900-1965, on this database). Other siblings were Alfred Lubinski (1904-1978), who had a travel agency and emigrated to Brazil, and Gerda Lubinski (born 1916). He married Hilda Cohn (1902-1983, also on the database), a social worker. The couple had two sons: Michael and Yehoyakim (Yuki). <\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>He studied law at the University of Berlin and the University of Frankfurt, and in 1927 he received his doctorate in law. He worked as a judge in a labor court, as a youth judge and as a youth counselor in Berlin. He also had a role as a public activist in the Zionist movement. For a while he served as secretary of the HaChaluts movement in Germany.<\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>During the \"Great Depression\" in Germany, there were distinguished individuals who tried to save what could have been saved. Dr. Lubinsky was a member of the ZWST, and he worked to establish social institutions for those who became destitute, and as a trustee for the Labor Zionist movement he worked hard to prepare places for agricultural training - <span><span>Hachshara - <\/span><\/span>for candidates for immigration to Palestine.<\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>In 1938 he immigrated to Palestine with his wife and children. In the years 1939-1948 he headed the social department of the Vaad Leumi founded by Henrietta Szold. When the Second World War broke out, and then the 1948 war in Palestine, he ran the division of the family of the soldier, who filled the duties imposed in a sovereign state, on the Rehabilitation Branch of the Ministry of Defense. Later he was director of the Department of Public Insurance in the Ministry of Labor. He ran the comparison fund for reservists. <\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>After the establishment of the State of Israel, he served as the director of the Department of Old Age Insurance at the Ministry of Labor, and as such he served on the inter-ministerial committee for planning social insurance and was sent as an Israeli representative to the UN Social Committee. He served as general director of the National Insurance Institute of Israel from 1954-1969. During these years, he also served for short periods as the general director of the Ministry of Welfare and Labor.<\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>For many years, a fund for the employment of pensioners operated in his name.<\/span><\/span><\/span><\/span><\/p> "]},"created":"1524677418","changed":"1582886751"},"1311":{"title":"Nathan, Thea Else (born Meyerowitz)","fields":{"field_biography":["Thea Nathan (née Meyerowitz) was born on 16.4.1908 in Königsberg and died in November 1988 in Jerusalem. Thea grew up into an assimilated family. As a juvenile, she was a member of the German-Jewish youth movement ‘Kameraden’ and of the young socialists ('Jungsozialisten', SPD). After completing her studies in social work in Königsberg's mission school, she held several positions as a social worker. As such, she worked with female sex workers and German-Jewish refugees in Germany and Switzerland (after moving to Switzerland in 1933). Thea immigrated to Palestine in the year of 1935. Soon after her immigration, she continued to work with Jewish refugees from Arab countries. Later on, she became a leading figure in establishing modernized social work institutions, especially in the fields of gerontology and working with people with disabilities. Finally yet importantly, she helped to develop welfare laws in Israel. Thea Nathan was awarded with the Henrietta-Szold-Award in 1965 and became a honorary citizen of Jerusalem 'Jakir Jerushalaym' in 1988. She was married to Max Nathan and they had one daughter together. "]},"created":"1525639729","changed":"1601551649"},"1459":{"title":"Liberman, Dina","fields":{"field_biography":["Dina Liberman was born in 1914 in Ostrava, Czechoslovakia to a Zionist home. The date and place of her death are unknown. She was an active member of the Blau-Weiß and the Maccabi Zionist youth movements and married around 1939. Miriam originally studied classical studies in Krakow, and later studied English and social work in Oxford, as well as economics and political science at the London School of Economics. Until 1946, Dina worked in England as a social worker for Jewish refugees. From 1947 through 1949, she worked as a social worker in Czechoslovakia. In 1949, Dina immigrated to Palestine, leaving for a period in the 1960s to continue her studies in Chicago. Upon her return, in 1950, she worked in ma'abarot or immigrant refugee camps in the Ramat Gan area. In the 1960s, Dina taught in and led the Tel Aviv School of Social Work under the supervision of Bella Schlesinger. Between 1963 and1967, she directed the Paul Baerwald School of Social Work in Jerusalem. During the 1970s, Dina devoted her time to conducting research in the field of social work. "]},"created":"1527340227","changed":"1546795514"},"1517":{"title":"Bloch, Zipora","fields":{"field_biography":["Zipora Bloch was born in 1901 in Russia and died on 8.2.1979 in Jerusalem. Zipora studied law and philology at Kiev University. Following the riots against Jews in east Europe, she worked in transition camps with youth and children that were disengaged from their families. She emigrated to Palestine in March 1921. She was introduced to the Joint organization by Rachel Ben-Zvi (an author, educator and a leading Labour Zionist, also the wife of the second president of Israel, Yitzhak Ben-Zvi), and soon began working with girls that were moved to the youth village \"Meir Shefya\", and later also with boys in another youth village in the north. Though very satisfied with her work, she was very ill in those years, suffering from malaria. She also acted as a case worker (non-professional) at the Nachalat Achim settlement house in Jerusalem in the late 1920s. In 1929 she travelled to Berlin and studied social work at the school of Dr (Ms) Schank \/Jugendheim Charlottenburg as an observer in the 1929\/30 winter semester. She did several internships in Berlin during this period (central for private welfare work, youth welfare office in Berlin-Schöneberg, care office in Berlin and Jewish welfare office in Berlin). Zipora continued her studies at the London School of Economics in the field of juvenile delinquency and preventive educational work at schools (children's casework, probation work, and settlements work). In 1942 she worked at the social work department of the Va'ad Leumi (Jewish National Council), in charge of youth and child care. She was also a lecturer at Siddy Wronsky's social work school in Jerusalem. In 1948, on the establishment of the Jerusalem ministry of welfare, she was appointed as the national supervisor of the youth and child care department. Zipora was also a member of the Mapai Party (the labour workers' party in Israel). "]},"created":"1527504416","changed":"1548284995"},"1518":{"title":"Fränkel-Eliner, Dora","fields":{"field_biography":["Deborah\/Dora Fränkel-Eliner (née Fränkel) was born on 30.11.1904 in Munich and died in 1982 in Israel. She was the daughter of Siegmund Aviezri Fraenkel (born in 1860 in Munich, died in 1925), who was a Jewish orthodox merchant and emigrated to Palestine in 1939. Her mother was Charlotte Haia, née Neuburger (1868–1965), who emigrated to Palestine in 1934. Her siblings were Abraham Adolf Halevi (1891–1965, Professor of Mathematics, em. to Palestine in 1933), Dr phil Yoel Ogen Fränkel (1892–1973, a statistician and merchant, em. to P. in 1938, Paula Tirza Levinger (born in 1901, em. to P. in 1933). Deborah married Eliezer Eliner, M.A. (born in 1904 in Libau, Latvia), a teacher who worked at Hebrew University. After 1920, Deborah did agricultural Hakhsharah (a training programme) and was a member of the ‘Blau-Weiss’ youth movement and the Zionist Federation. Until 1926, she worked in the Ahawah Jewish orphanage in Berlin. She studied social work in Munich and graduated in 1929. Between 1929 and 1930 she was a social worker in Frankfurt, and between 1931 and 1934 in Munich. Additionally, she was a ministry official. Deborah emigrated to Palestine in May 1934, was married to Rabbi Eliezer Eliner (the couple had no children), and immediately started to work with Henrietta Szold in the ‘Youth Aliyah’, where she was in charge of the religious youth department. In this position, she recommended the establishment of religious youth villages in Palestine. She also worked for the Mizrachi women's movement in Jerusalem with the unemployed. Between 1941 and 1945 she headed the labourers' department at Hapoel HaMizrachi. Between 1945 and 1947, Eliezer was sent by the National Council to Italy, for educational work at the Jewish refugees' camps, accompanied by Deborah. During 1947 and the 1950s, Deborah worked at the Jewish Agency as the head social worker for the Oleh (Jewish immigration). Between 1948 and 1962 she directed the district of Jerusalem's department for immigrant integration. She was also in charge of social welfare at the Ma'abarot refugee absorption camp. Between 1954 and 1970, she held a leading position at the ministry of social welfare. Over the years she continued to work and volunteer in welfare, immigration and education institutions in Jerusalem. She was awarded the Jerusalem Prize for social work. "]},"created":"1527504524","changed":"1541413831"},"1519":{"title":"Ollendorff, Fanny (née Baer)","fields":{"field_biography":["Fanny Ollendorff was born on 7.9.1893 in Halberstadt, Germany and died in 1983 in Jerusalem. Her parents were Joseph Baer, who was connected to the ‘Messingwerke’ in Eberswalde, near Berlin, and Rosalie Baer, née Dessau. They were a family with eight children. Among them were Helene Barth (1891–1982), who emigrated in 1924 to Palestine and was also a teacher and a social worker. The children grew up in a strictly traditional community and family. Fanny led the Jewish day-care centre in Halberstadt during World War I and attended a Red Cross course. She devoted herself to family and infant care. In 1918 she attended the Soziale Frauenschule in Munich under Frieda Duensing, before completing her ed-ucation at the Soziale Frauenschule in Berlin-Schöneberg under Alice Salomon. From 1921, Fanny worked at the ‘Jüdisches Volksheim’ in Berlin, first as a youth leader and later as its manager. There she met Friedrich Ollendorff, a leading Jewish social worker in Germany and later in Palestine\/Israel; they married in 1923. For a short time, she worked at the ‘Zentrale für private Fürsorge’, Berlin. Between 1926 and 1929 she was a social worker at Dr Neumann's children's home and attended courses at the ‘Hochschule für Politik’, Berlin. In 1934 she immigrated to Palestine and began working as a social worker in the Lishkat Sozialith of the Va'ad ha-Kehillah, establishing social work in Jerusalem together with the director and with Henrietta Szold. Then, she became deputy manager and later took over the management. In 1947, she went to the United States with Friedrich and con-tinued to train in social work there. After their return and after the end of the war in Israel, social work became part of the city administration. After the death of her hus-band in 1951, she ended her work on the municipality and started her work at the min-istry of welfare (Misrad ha-Sa'ad). She led a group of students in Beth Shemesh, and later in Haifa. Then she headed the welfare office (Lishkat Sozialith) in Kiryat Gat. As in Beth Shemesh, she mainly worked with new immigrants. Later, she led a course for ac-ademically trained social workers, after which she left work and volunteered in the so-cial field. In the 1960s, she was involved in community projects in Jerusalem for youth and the elderly with Hilde Lotan. "]},"created":"1527533053","changed":"1578228260"},"1587":{"title":"Ollendorff, Friedrich","fields":{"field_biography":["<p><span><span><span><span><span lang=\"EN-US\"><span>Friedrich Ollendorff<\/span><\/span> was born in 1889 in Breslau, Germany and died in 1951 in Israel. He married Fanny Baer, a Jewish social worker. Ollendorff studied law. After service in the German army in World War I, he was appointed legal adviser to one of the district municipalities of Berlin. He later turned to welfare work and was one of the highest officials in the youth welfare and welfare administration of the Berlin municipality. He played an active role in preparing modern welfare legislation in Germany. In 1924 he left his post to become director of the \"Zentralwohlfahrtsstelle der deutschen Juden\" (Central Office for Social Welfare of German Jewry) and co-editor, with Max Kreuzberger, of the Collection of Welfare Legislation. Ollendorff introduced many new ideas and practices in Jewish welfare work in Germany. He was also one of the initiators of the International Conference of Jewish Social Work, which held its first meeting in 1928 in Paris. In 1934 he immigrated to Palestine together with his wife, Fanny, and became an adviser to Henrietta Szold, then director of the social welfare department of the Vaad Leumi. He introduced a well-planned program for the social services of the Jewish community in Palestine, and also the Kartis ha-Kaḥol (the blue contribution card) as a means of collecting regular contributions for social welfare in Jerusalem. He became the first honorary secretary of the Jerusalem social welfare council, which was composed of the director of social welfare of the Palestine government and representatives of Jewish, Christian, and Muslim welfare institutions.<\/span><\/span><\/span><\/span><\/p> "]},"created":"1528457977","changed":"1582886047"},"1588":{"title":"Barth, Helene (née Baer)","fields":{"field_biography":["<p>Helene Barth (née Baer) was born in 1891 in Halberstadt, Germany and died in 1982 in Jerusalem. Her brother, Fritz Itzhak Baer, was a historian and an expert in medieval Spanish Jewish history at the Hebrew University. Helene was an active Zionist, teacher and social pedagogical expert. Between 1911 and 1924, she worked as a teacher for the Jewish community of Berlin and in other posts. Helene was also an artist and a painter, having studied with Adolf Schmidt and Hermann Struck in Germany and later with Yaakov Steinhardt and Mordechai Ardon. She immigrated to Palestine in 1924, where she headed the Mizrachi movement teacher seminary. She was connected with the philosopher and historian Gershom Scholem and with the philosopher and educator Ernst Simon, whom she followed to Haifa in order to work at a secondary boarding school which was headed by Dr. Biram. After 1948, she headed the Department for Special Education at the Ministry for Education. In 1978, she was awarded the Jerusalem Prize for good citizenship. She continued to paint throughout her life and had her work exhibited at the Israel Museum.<\/p> "]},"created":"1528458000","changed":"1575556846"},"1589":{"title":"Lehmann, Siegfried","fields":{"field_biography":["<p><span><span><span><span><span lang=\"EN-US\"><span>Siegfried Lehmann<\/span><\/span> was born on 4.1.1892 in Berlin, Germany and died on 13.6.1958 in Israel. Lehmann was born to an assimilated Jewish family. After finishing high school, he entered a medical school where he studied together with Albert Einstein. During World War I he served as a physician in the German Army. After the war he joined the Zionist movement and the Socialist movement. He founded a Jewish orphanage and education center (Jüdische Volksheim) in Berlin in 1916, and opened a shelter for Jewish war orphans in Kaunas in 1919. In 1927, he immigrated to Mandate Palestine. There, he founded the Ben Shemen Youth Village, a large agricultural boarding school, situated adjacent to moshav Ben Shemen. He directed Ben Shemen Youth Village from 1927 to 1957 and received the 1957 Israel Prize in Education for it. In 1940, he was imprisoned by the British Mandate authorities because they found arms depots at the village (the \"Ben Shemen trial\"). <\/span><\/span><\/span><\/span><\/p> "]},"created":"1528461074","changed":"1601551697"},"1590":{"title":"Rosenblüth, Zessi","fields":{"field_biography":["Zessi Rosenblüth was born in 1898 in Berlin and died in 1981 in Kibbutz Geneygar. She started her social work studies in Breslau, but did not graduate. Being an enthusiastic Zionist, she emigrated in 1921 to Palestine, together with her husband Felix Rosenblüth, with whom she later had 3 sons. Since she did not have an official social work diploma, it was difficult for her to work as a professional at the forming welfare services of the Yishuv. She started working as an educational volunteer with Oriental Jewish children in Haifa. Later, the couple moved to Jerusalem and Zessi headed the Jerusalem WIZO branch and continued to volunteer under the instruction of Henrietta Szold. As she spoke German as a native language, she started working with German Jews. Only in her 40s did she graduate from Siddy Wronsky's social work school in Jerusalem and finally become a professional social worker. First, she worked at the social work department in Jerusalem and was trained to help the victims of the 1936–39 riots. After 1948 she was elected to represent Israel as a practitioner of the UN in a professional rehabilitation training programme in England. She also established the first professional rehabilitation centres in Israel. Afterwards, she initiated social work courses for Jews and Arabs in the city of Haifa. Following their son, Zessi and Felix moved to Kibbutz Geneygar, where Zessi worked as a social worker and was one of the founders of the social work service for the Kibbutzim movement, until her retirement. In 1979, she was awarded the ‘Hazani’ award for her contributions to social work. "]},"created":"1528461184","changed":"1549735504"},"1591":{"title":"Schächter, Regina","fields":{"field_biography":["Regina Schächter was born on 28.3.1896 in Berlin and died in 1988 in Jerusalem. Between 1917 and 1921 she was head secretary at the Berlin Central Verein. Between 1921–1925 she volunteered as a mentor at Dr Sigfrid Lehman's ‘Yiddisher Volksheim’ youth institute for Jewish refugees from east Europe after the First World War. She continued to volunteer and it was only 10 years later, at the age of 33, that she began to study at the Verein Jugendheim (Easter 1929 – October 1929), encouraged to do so by Siddy Wronsky, and graduated with honours. Between 1925 and 1927 she worked as a welfare worker at the Jewish community in Berlin with Ostjuden, and until 1935 she headed the Jüdische Alterhilfe. Regina was a Zionist, influenced by Martin Buber's ideas, and between 1925 and 1929 she worked as the head secretary of the German Association of Zionist Women (‘Bund zionistischer Frauen Deutschlands’), participating in the 1927 Zionist congress. She accompanied the first youth group moving from the German ‘Yiddisher Volksheim’ to the Ben Shemen youth institute in Palestine and also helped transfer the ‘Ahava’ children's institute, founded by Beate Berger, to Palestine in 1934. There, she once again met up with Siddy Wronsky and also Henrietta Szold, who prepared her to work as a professional social worker by improving her Hebrew skills and understanding of the unique conditions in Palestine. Following a return to Berlin, in 1935 she emigrated for good. Afterwards, she began working at the welfare office of the city of Ramat Gan together with Hava Danziger (later to be Magnes). They founded many important services such as children's day-care for working mothers and a warehouse of clothes for the needy. She expanded her work into other neighbourhoods surrounding Ramat-Gan, an act which almost caused her dismissal due to political objectification by the Jewish National Council (‘Va'ad Leumi’). After the end of World War II, Regina was nominated as the first national supervisor of the social work services in the Yishuv, continuing in her position after 1948 and heading the department of organization and supervision at the ministry of welfare until her retirement in 1962. In 1950, she participated in the international social work congress in Paris. Following the independence war, Regina began with social activism in favour of the Arab refugees. She initiated the first social work training programme for Arab social workers and was involved in the Paul Baerwald school in Versailles. "]},"created":"1528461217","changed":"1550937859"},"1592":{"title":"Hanf-Weinreich, Frieda","fields":{"field_biography":["Frieda Hanf-Weinreich (née Weinreich) was born in 1898 in Pinsk (then Poland, now Belarus) and died in 1965 in Haifa. She was the daughter of Shaul Weinreich and Rachel Lurie, and sister of the social worker Dr. Anni Samuelsdorf, Ismar Weinreich and Max Weinreich. She worked in Dresden with children at risk, endangered and criminal youth and headed the unemployment service for women. Later she headed the health department at the Zentralwohlfahrtsstelle der Juden in Deutschland (ZWST) in Berlin. She immigrated to Palestine in 1935, and was married to Dr. Otto Hanf (1889–?), who immigrated to Palestine in 1938. After her immigration to Palestine Frieda was the first social worker at the new Jewish colonies – the moshavot. She was also involved at the disposal of the organization of the Jews from Germany, the Hitachdut Olej Germania (now Hitachdut Olej Merkaz Europa), and took charge of the organization's employment and careers advice bureau. During the 1930s, she was also involved in trying to help Jewish female immigrants who had just arrived at the ports of Jaffa and Haifa. When the State of Israel was established, she became an official at the Ministry of Welfare. She retired a few years later but continued her welfare activities in Haifa in a voluntary capacity, and founded the citizens' advice bureau in Haifa."]},"created":"1528461272","changed":"1542532695"},"1593":{"title":"Hochwald Katz, Hilde (née Hochwald)","fields":{"field_biography":["Hilde Hochwald Alexander-Katz (née Hochwald) was born on 12.5.1902 in Berlin and died in 1992 in Haifa. She began her career as a kindergarten teacher of infants born outside marriage. With the encouragement of her mother, who did voluntary social work, she studied later at the Alice Salomon school (Soziale Frauenschule, Berlin; full course October 1927\/29) and did her practical training at a refugee center of Eastern Europe Jews (Jiddisches Volksheim). Other activities in Germany were in a Jewish orphan's home, in a 'Kinderlandheim' (not specified), Jewish children's welfare office, diverse leading activities as kindergartener, one year leader of infant department of Jewish welfare school (not specified). She also worked at the institution for Jewish girls managed by Bertha Pappenheim, who emphasized the religious aspect of the profession. Pappenheim's approach did not suit the spirit of the Zionist youth movements. To the dismay of her parents, who were assimilated Jews, Hochwals became closer to Zionism and went to work at the Kovno institution of Dr. Siegfried Lehmann in preparing children for immigration to Palestine. She herself immigrated to Palestine in 1929, striving to be a pioneer in a kibbutz. Finally, she settled in Haifa and worked as a nanny at the WIZO nursery, but soon was appointed to head the institution. As a result, she was invited by Henrietta Szold to work as a social worker in the Youth Aliyah. Later, she served as an executive secretary in the Union of nurses, social workers, and pharmaceutical, a rare opportunity that has opened the door to assimilate professional social work in the worker's union. Then, she became a national supervisor by the National Council in the field of outdoor care and arrangement of immigrant children. In 1934 she was appointed by Siddy Wronsky to map, investigate and supervise foster care families and institutions, while monitoring the status of these children. From 1941 until her retirement in 1967 she directed the Bureau of social work in Haifa, where she implemented the concept of team meetings and emergency social work and set up a nursery, clothing warehouses and soup kitchen as well as an advice center for citizens. In addition, she wrote articles in international journals and in 1957 took part in the advisory committee to the minister of welfare Moshe Shapira. She was identified with Mapai Party (the labor workers party in Israel). Hilde was married later in her life to Ernst Alexander Katz, A Jewish-German lawyer\/economist. The couple had no children."]},"created":"1528461301","changed":"1575644799"},"1597":{"title":"Berger, Beate","fields":{"field_biography":["Beate Berger was born 1886 in Niederbreisig, Germany and died on 20.5. 1940 in Kiryat Bialik in Israel. Trained as a nurse, Beate was the director of the Berlin-based Jewish orphanage and children’s home, Ahawah, which worked primarily with orphans from Eastern Europe, promoting Zionism and using progressive educational methods. Already in 1934, she transferred the Ahawah home and over 100 of the children living there to the Ahava Youth Village in Kiryat Bialik in Palestine, which she founded and directed based on the Ahawah model, and which still operates. Her siblings Else, the first woman allowed to study at the university in Cologne, Julius and Alfred were also involved in the work of Ahava, with Else directing the school, and Alfred and Julius helping with administration."]},"created":"1528461461","changed":"1534166972"},"1600":{"title":"Itzkovitz, Miriam (born Chotory)","fields":{"field_biography":["Miriam Itzkovitz (née Chotory) was born in Russia and immigrated to Palestine at the age of six. The dates of her birth and death are unknown. She completed her high school studies at the prestigious Gymnasia Herzliya in Tel Aviv. Miriam studied theology and psychology for two semesters at the Sorbonne University in Paris. She later studied psychology and philosophy in Geneva, Switzerland at the Jean-Jacques-Rousseau Pedagogical Institute, where she earned her PhD. She also studied social work at the Soziale Frauenschule in Geneva. She then worked for three years at summer camps for Jewish immigrant children in France, while also engaging in social case work with the families of these children. Subsequently, she worked at the Institute Mounier in Geneva teaching and treating German-Jewish youth. Miriam received further training in other institutions in working with children with psychological and cognitive problems. The exact date of her immigration is unknown, but she lived in Hadera in 1938, where she worked in the municipal department of social work with Zipora Bloch. Later, in the 1940s, she worked as a lecturer and taught courses in psychology and pedagogy. In Tel Aviv, she taught the course “Sociology of the Oriental Jews.” In the 1950s Miriam became the head of the School of Social Work in Jerusalem where she emphasized the history and philosophy of social work in her classes. She worked closely with Siddy Wronsky, a leading social worker, and wrote articles about her. In 1963, she wrote a report on the training of social workers for rural and development areas. "]},"created":"1528461556","changed":"1542627335"},"1601":{"title":"Kraemer-Rosenkranz, Stela","fields":{"field_biography":["Stela Kraemer-Rosenkranz was born in Dresden, Germany (year unknown) and died in Israel (year unknown). She studied at the social women’s school in Dresden, did practical training at Berlin city council caring for wayward girls and women, and worked for two years as a social worker at the Schocken department stores in Berlin. After her immigration to Palestine in 1933, she worked for one year in a women immigrants' hostel in Haifa, helping to find the girls homes and employment. Afterwards, she spent five years as a social worker in all fields at the Haifa city council welfare department. From 1939 she worked as a social worker with families in Petah Tikva. She spoke Hebrew, English, German, French, and a little Arabic. "]},"created":"1528461600","changed":"1544889977"},"1602":{"title":"Eskeles, Paula (born Kronheimer, married name Müller)","fields":{"field_biography":["Paula Eskeles (née Kronheimer, married name Müller) was born on 28.3.1902 in Fürth, Germany and died in 1994 in Israel. She earned her PhD in Political Sciences at the University of Cologne in 1923. Paula worked as a social worker at the ‘Zentralwohlfahrtsstelle der Juden in Deutschland’ (Central Welfare Bureau for Jews in Germany, ZWST) and between 1931 and 1932 as a teacher and educator in the Jewish children's home in Caputh. Additionally, she edited the journal ‘Jüdische Wohlfahrtspflege und Sozialpolitik’ (Jewish welfare work and social policy). In 1932, she married Otto Eskeles, a banker, with whom she had two children. The family immigrated in 1937 to Palestine and lived in Haifa. Paula worked at the youth aliyah in Haifa, and as a social worker in the Atlit refugee camp. "]},"created":"1528461625","changed":"1541177863"},"1604":{"title":"Magnes, Chava (born Danziger)","fields":{"field_biography":["Chava Magnes (née Danziger) was born in 1914 in Germany and died 2015 in Jerusalem. She was the daughter of Malka and Felix Danziger, a social worker and a surgeon, respectively. Together with her parents and family, Chava immigrated to Palestine in 1923. She was married to David Johnny Magnes, the son of Yehuda Leyb Magness and they had one daughter. Chava was a student at the training school for social work in Jerusalem between 1935 and 1936. Later, she continued her education at the London School of Economics and in a work center in the Netherlands, Viringen an der Suider See. Chava worked together with Regina Schaechter in a welfare office in Ramat Gan in the late 1930s and into the 1940s. She headed the Hebrew youth center Beit Hanoar Haivri and was a member of the national council of Jewish Women. "]},"created":"1528461677","changed":"1547045103"},"1650":{"title":"Popper Lilli (born Zadek)","fields":{"field_biography":["Lilli Popper (née Zadek) was born in 1893 in Berlin and died in 1969 in the Israeli city of Holon. She was the daughter of Julia, who worked in adult education and was the sister of Edward Bernstein, a well-known member of the German Social Democratic Party (SPD). Another brother, Walter Zadek, was an acclaimed socialist, journalist and the editor of the newspaper Berliner Tageblatt in Berlin, and later became a highly-respected photographer in Tel Aviv. His wife was Jetty Zadek, who was also a German-Jewish social worker. Lilli was a graphic designer, having studied at the Kunstgewerbeschule arts and crafts school in Berlin with Käthe Kollwitz. She also worked as a teacher and a social worker. Lilli was a member of the Oley Zion movement in Germany and was affiliated with central figures in the Zionist movement, such as Siegfried Lehmann, Martin Buber, Berl Katzenelson and others. Lilli became attracted to the Jüdisches Volksheim, the Jewish community center founded in Berlin by Siegfried Lehmann, where she also met members of the Zionist Socialist movement. One of them was Zalman Shazar, later to become President of the State of Israel. After her immigration to Palestine in 1920, Lili worked in agriculture and managed Beit Chaluzot, a home for pioneer girls in Tel Aviv. Later, she became a kindergarten teacher and a social worker, working in a number of locations, including an orphanage in Sheffia. She participated in Moezet Poalot, the women's workers movement, and in the Histadruth Imahot Ovdot, an organization for working mothers. During the 1950s, Lili headed the department of social work in the city of Holon. After her retirement, she continued to volunteer, working with the needy and giving English and Hebrew lessons to youth and adults. Throughout her life, she was also well-known as a graphic designer and illustrator of children’s books. In addition to being a member of Israel’s Mapai party, she wrote articles for the feminist socialist journal, Dvar Hapoelet, for many years. "]},"created":"1533491243","changed":"1549322577"},"1666":{"title":"Jarecki, Natalie","fields":{"field_biography":["Natalie Jarecki was born on 25.2.1908 in Berlin and died on 7.5.1997 in Kibutz Mizra. Natalie worked as a kindergarten teacher in 1928. Between 1932 and 1933, she trained as a youth leader Jugendleiterin at the Sozialpädagogisches Seminar of the Verein Jugendheim Berlin-Charlottenburg. There, she was trained by the renowned educator Janusz Korczak. She also became a member of a non-Jewish socialist-communist association of kindergarten teachers, educators, psychologists and social workers, that was banned after the Nazis came to power. After completing her studies in 1933, Natalie headed a Jewish kindergarten. Natalie was a member of the Zionist movement Hachalutz in Germany. In 1936, she immigrated to Kibbutz Mizra in Palestine with a friend as part of a youth group. There she worked in agriculture, and later headed the Beit Yeladim, or children's house of the kibbutz. In her later years, she worked in the archives of the kibbutz. One of Natalie’s sisters was Hilde Jarecki, who also attended the Jugendheim before emigrating to England, where she developed the concept of playgroups. In England, Hilde lived and worked together in the field of education with Sophie Friedländer. "]},"created":"1533496856","changed":"1533499209"},"1681":{"title":"Schattner, Naomi (born Blumfeld, Hilde )","fields":{"field_biography":["Naomi Schattner was born as Hilde Blumenfeld on 21.8.1909 in Hanau in Germany and died on 1.2.2012 in Jerusalem. Naomi studied at the pedagogical academy in Frankfurt and graduated as a teacher in 1931. She subsequently moved to Oslo but returned to Germany in 1933 to work at the Jewish Home for Children in Caputh until 1934. In 1936, she immigrated to Palestine where she attended courses for immigrant educators. In her first years in Palestine, she worked with youth aliyah or immigrant youth, in the Ahava children's home in Kiryat Bialik, which was the successor institution of the Ahawah Orphanage in Berlin-Auguststr. Later, she worked as a teacher, an educator and a psychotherapist. Naomi was married to the geographer Prof. Yitzhak Schattner and was a member of the Hapoel Hamizrachi movement. "]},"created":"1533576043","changed":"1542532805"},"1700":{"title":"Stein, Nadia (born Brodsky)","fields":{"field_biography":["Nadia Stein (née Brodsky) was born on 2.2.1891 in Odessa, Russian Empire, and died on 14.12.1961 in Haifa. She was a Zionist and a feminist activist. Her father was the chief engineer employed at the local oil wells. He died young, after which her mother moved with the children to Vienna. In 1911, Nadia received a high school teacher's degree in geography from the University of Vienna and worked at the reform school of Eugenie Schwarzwald. In 1917, she married Andor (Herbert) Ornstein, and in 1922, they had a daughter, Michaela (born 1922). As women in Austria were not permitted to study for a doctorate, Nadia continued her studies at the University of Zürich, and completed her doctorate in economics and sociology in 1919. Her thesis topic was municipal plebiscites in Zürich from 1893–1917. The persecution of the Jews after World War I prompted her to become associated with the Zionist Movement. From the time of the first WIZO Conference in Karlsbad in 1921, she became one of WIZO's most ardent advocates. Together with Anitta Müller-Cohen, Nadia Stein founded the Women's International League for Peace and Freedom in Vienna. Moving to Romania because of her husband’s work, she founded a branch of WIZO there and managed its cultural and propaganda work. She also arranged aid for thousands of refugees who fled from the pogroms in the Ukraine. From 1924 to 1926, Nadia worked as an organizer, publicist and speaker for Hadassah and the Jewish National Fund (JNF) in the United States and Canada. Upon her return to Europe in 1927, she founded a branch of WIZO in Berlin. In 1932, Nadia immigrated to Palestine and served as the head of WIZO's Propaganda and Publicity Department. In addition, she worked as an editor for the WIZO journal, and prepared written and pictorial information for about 50 WIZO federations. She also continued travelling across the globe working for Hadassah and the JNF. From 1932, Nadia also worked on the establishment of an educational film center in Israel. In 1950, the British WIZO office awarded her a two-year scholarship to study at the Hebrew University, where she carried out research on planning urban communities in Israel, with an emphasis on women's point of view. She spent one year in the United States and England engaging in housing projects and postwar community rebuilding and also made a study trip to Sweden and Denmark. In 1952, Nadia was invited by the Haifa Municipality to implement her plan of organized community services. In addition to all these activities, Nadia was also a freelance journalist and literary translator for several Zionist newspapers. After retiring from WIZO, Nadia founded The Golden Age Center in Haifa, a community center for the elderly. "]},"created":"1533933191","changed":"1534356927"},"1701":{"title":"Ullmann, Hanni (born Risch)","fields":{"field_biography":["Hanni Ullmann (née Risch) was born on 10.9.1908 in Posen and died on 28.9.2002 in Kfar Saba in Israel. Her family, which was both religious and wealthy, initially resided in Posen and moved to Berlin in 1918. She was a member of the Jewish youth movement Blau-Weiß, where she became familiar with socialist and Zionist ideas. In addition, she was active in the Jewish women's movement. Between 1924 and 1926, Hanni was trained as a kindergarten teacher in Berlin at the Sozialpädagogisches Seminar of Jugendheim-Charlottenburg under Anna von Gierke, which was an influential interdenominational school with wide-ranging interests and which trained students to work in a number of different social-pedagogical fields. The school had a significant impact on the development of German social work. Hanni completed her practice training at the Ahawah Jewish orphanage. In 1929, Hanni married Ernst Menachem Ullmann and immigrated to Haifa in Israel. She gave birth to three children and adopted a refugee child from Teheran. When Beate Berger transferred the Ahawah home and school to Palestine in 1934, Hanni rejoined the orphanage, and later succeeded Hugo Bergmann as its director. In the 1950s, she was awarded a scholarship to participate in a special training course in Zurich for working mentally damaged children. Returning to Israel after completing the course, she founded a school for children's nurses. In the 1970s, she established the Neve Hannah children’s home, introducing the innovation of organizing child care in small family units. Additionally, she initiated projects to promote peace between Israelis and Arabs. "]},"created":"1534165258","changed":"1540221728"},"1702":{"title":"Rosenthal, Hugo (Jashuvi, Joseph)","fields":{"field_biography":["<p><span><span><span><span><span lang=\"EN-US\"><span>Hugo Rosenthal<\/span><\/span> (Joseph Jashuvi) was born on 14.12.1887 in Lage (Lippe) and died on 6.12.1980 in Haifa, Israel. He was born to a low-income Jewish family of 9 children. Hugo studied at a Rabbi-Seminary and at a Jewish teacher seminary in Münster\/Westf. He taught at Samson-School in Wolfenbüttel. Hugo was a very early member of the Zionist youth movement and a member of Blau-Weiß. Later, he joined Brit Haolim. After WWI, he did Hachschara and became a teacher for sport and handicraft. Afterwards, he married the pianist Betty (Yehudit) nee Goldschmidt, and in 1925 he immigrated to Palestine with his family, where he tought at the school of Artur Biram in Haifa sports and handicrafts until 1929, when he returned to Germany. After his return to Germany, he studied in Berlin and worked at a Jewish elementary school in Berlin-Rykestr. He studied the psychology of Jung and conducted studies on the psychology of the Jewish child. Since 1933, he demanded for an independent Jewish educational systems, which prepares for emigration to Palestine. He headed the country boarding school (Landerziehungsheim) Herrlingen\/Ulm until its liquidation in 1939. After his second emigration in 1939 to Palestine, he worked for one year in Ben Shemen youth village. Between 1940-1958, he headed the Ahawah-home after Beate Berger had died. After 1958, he did research work on pedagogical and psychological topics and published a textbook titled Erziehung und Tradition. <\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span>In 1943, his eldest son, Gabriel, was killed while serving in the British army. Not long afterward, the towns learned that three of their sisters and other family members had been murdered by the Nazis.<\/span><\/span><\/span><\/span><\/p> <p><span lang=\"EN-US\"><span><span>Upon his retirement in February 1957, he was awarded in Geneva for his educational activities on behalf of The International Save the Children Union. In the framework of the 45th anniversary of \"Youth Aliyah\" (1977), he was awarded the title \"Yakir Aliyat Hanoar\". Over the years he has researched, written and published psychological and educational studies, legends, and reflections. Some of them were published in his book \"Education and Tradition\" (1966), and some of them are stored in his estate, which is in the Yad Vashem Archives in Jerusalem. He also wrote in German his memoirs from his childhood and youth – between the years 1887-1914, and the book was translated into Hebrew by his son Uriel Yashubi in 2003.<\/span><\/span><\/span><\/p> "]},"created":"1534165315","changed":"1582885973"},"1712":{"title":"Rosenberg, Dr. Maya ","fields":{"field_biography":["Dr. Maya Rosenberg was born in 1904 in Romania and died in 1970 in Israel. She immigrated to Palestine in 1911 and studied at the Reali School in Haifa. Around 1927, Maya moved to Vienna in order to study philosophy and education, returning to Palestine around 1929 to establish social institutions for Jewish children from Eastern Europe. In 1932, Maya established a vocational school for Yemenite girls in Rehovot, which was influenced by Jessy Sampter. The institution, which included a daycare nursery, kindergarten, elementary school, trade school and farm, gave academic and vocational training to 225 girls from the poor Yemenite community. This institution became part of the Women's International Zionist Organization (WIZO) in the 1940s. Dr. Rosenberg was especially interested in the welfare of Jews from Arab countries, and the school aimed to help the pupils and their families attain higher standards of living by providing an education that would produce skilled workers in agriculture and that would enable students to engage in native Yemenite arts and crafts, such as embroidery, weaving, basketry and jewelry making. "]},"created":"1534167157","changed":"1534169410"},"1772":{"title":"Kaphan, Johanna","fields":{"field_biography":["Johanna Kaphan was born on 25.1.1892 in Berlin and died on 8.12.1969 in Haifa. She graduated as a teacher from the teacher seminary of the Viktoria-Luisen School in Berlin in 1911. Subsequently, she received further training in Judaism while also working as a teacher in a private school. From 1915, she taught at Berlin’s Jewish community’s middle school for girls. In addition, she studied at the Seminary for Individual Psychology in Berlin and was a guest student at a University of Berlin, where she studied German studies, psychology and theology. Between 1929 and 1939, she directed the girl's elementary school of the Jewish community in Berlin-Auguststr and worked from 1932 until 1933 in the Ahawah Jewish children’s home, then led by Beate Berger, who transferred the institution to Palestine in 1934. In 1939, Johanna emigrated from Germany to Sweden, where she headed a newly-established hachschara or training camp for youth and founded a home for emigrants. Johanna also directed a large refugee camp there. In 1949, Johanna emigrated to Palestine, where she worked as a social worker at the municipality of Haifa until 1957. In 1974, her friend Hanni Ullman named the children’s home in Kiryat Gat Neve Hannah after her. Neve Hannah was innovative, being the first children’s home based on small family units. Hannah was part of the planning phase of the home and contributed all her inheritance to the project after she died. "]},"created":"1534427885","changed":"1543267038"},"1784":{"title":"Aloni, Jenny (née Rosenbaum)","fields":{"field_biography":["Jenny Aloni (née Rosenbaum) was born on 7.9.1917 to Henriette and Moritz Rosenbaum in Paderborn, Germany and died on 30.9.1993 in Ganei Yehuda in Israel. She grew up in a well-established family in Paderborn and attended a Catholic Lyceum until 1935. In reaction to the increasing number of anti-Semitic hostilities since 1933, she turned to Zionism as well as to socialist ideas. In 1935, she began preparing for her immigration to Palestine in the Spreenhagen hachschara training school. Out of consideration to her parents, she delayed her plans to leave for Palestine and instead studied in the school of the Berlin synagogue Adass Iisroel from 1936 until her graduation. Nonetheless, she continued to make contacts with socialist groups within the Zionist movement and learned Hebrew and Arabic. Following her graduation from high school in 1939, she worked as a hachschara or training group leader in the Schniebinchen (today Świbinki, western Poland) training camp. She soon thereafter immigrated to Palestine via Trieste with a youth aliyah group transporting Jewish children and adolescents. In Jerusalem, she studied literature at the Hebrew University and did voluntary social work for neglected children and adolescents. In 1942, she enlisted in the medical service of the Jewish Brigade of the British Army. In 1946, began her studies in Jerusalem to train to work in social service. She reflected on this training in her diaries, which have now been published. Jenny did not complete her studies but did continue her voluntary social work. Between 1938 and 1950 she worked with the Labor youth movement as a vocational counsellor. Later, in Paris and Munich, she helped to repatriate Jews to their home countries or to immigrate to Palestine. In 1948, Jenny Rosenbaum married Esra Aloni, who had immigrated to Palestine in 1934. Jenny served as a paramedic during Israel’s War of Independence in 1948. In 1950, her daughter Ruth was born, and in 1955, Jenny Aloni visited her hometown of Paderborn for the first time since 1935. Beginning in 1957, the family Aloni lived in Ganei Yehuda near Tel Aviv. For nearly 20 years, Jenny Aloni was a volunteer at the public psychiatric clinic in Be’er Ya’akov. Because she was so successful in her work, she was able to participate in case conferences in the clinic. Before and after immigrating to Israel, Jenny’s primary vocation was that of a writer. She wrote short papers and poems in Hebrew that were published n Dovrat Ha-Po'elat, a feminist socialist journal, but most of her writing was in German. Her works included short stories, poems and diaries. Her diaries recounted such events as her childhood in the Third Reich, the ingathering of exiles in Israel and the Israeli-Palestinian conflict. In the 1960s, she received attention from the renowned writers Max Brod and Heinrich Böll. Jenny Aloni is considered to be among the most important writers who wrote in German in Israel. In 1967, she won the Paderborn Cultural Award for her writings. She was awarded the President’s award for her volunteer work in the Be’er Yaacov psychiatric hospital in 1976. In 1991, she received the Annette von Droste-Hülshoff literary prize. "]},"created":"1534853614","changed":"1601550051"},"1791":{"title":"Apfelberg\/Appelberg, Dr. Esther","fields":{"field_biography":["Dr. Esther Apfelberg\/Appelberg was born on 16.10.1923 in Hamburg, Germany and died on 17.10.1974 (place unknown). Her brother was Yehuda Appelberg, a diamond trader. In 1939, she immigrated to Palestine with her family. Esther never married. She did training for the Youth Aliyah organization and studied at the Mizrachi movement teacher seminary in Jerusalem between 1939 and 1944. From 1944 to 1945, she worked as a teacher, after which she served as a secretary in the Labor Federation for working youth in Jerusalem. Until 1949, she was active in welfare, educational and refugee work with the Jewish Agency in Germany, and in displaced persons camps among other places. She also was responsible for displaced persons’ transports to Marseille. She was a social worker in schools in Jerusalem between 1949 and 1951. She then studied at the School of Applied Social Science of the Case Western Reserve University Cleveland, receiving a Master’s of Social Science Administration in 1953. From 1943-1955, she also served as a district inspector in the youth and children department of the Israeli Ministry of Welfare, and also was a lecturer at the Ministry’s Institute for Welfare Work. Esther also lectured on welfare work and children's welfare work at the School for Social Work in Tel Aviv University between 1953 and 1957. Between 1955 and1956, Esther worked as a psychiatric social worker at the Lasker Institute for mental health in Jerusalem. From 1956 through 1957, she was involved in psychiatric social work at a child guidance clinic, was a supervisor of Youth Aliyah in Jerusalem, and at the same time lectured at the Siddy Wronsky's school for social service in Jerusalem. In 1957, Esther immigrated to the United States. Between 1958 and 1961, she did administration work at the Bellefaire Treatment Center in Cleveland. In 1961, she was awarded a PhD in Social Work from Case Western Reserve University. From 1964 through 1972, Esther worked as lecturer at several institutes and universities. In 1968, she collaborated in a research project on foster children at the Boston College’s School for Social Work. The next year, she became a counselor at the Bellefaire Treatment Center in Cleveland. Between 1969 and 1974, she served as a Professor at Yeshiva University’s Wurzweiler School for Social Work, in New York. She was a visiting professor at the Tel Aviv University School of Social Work between 1971 and 1972. She was a member of the Israeli Association of Welfare and Social Workers, becoming its Vice Chairperson in 1954 and its Chairperson in 1956. She was a committee member for the International Jewish Social Work of the Jewish Communal Service Association of North America, the National Association of Social Workers, the Council of Social Work Education and the Child Welfare League in north America. "]},"created":"1534855066","changed":"1561920510"},"1835":{"title":"Avneri, Bruria (born Heymann, Bertha )","fields":{"field_biography":["Bruria Avneri (née Bertha Heymann) was born on 10.4.1901 in Duisburg and died in 1974 in Haifa. Her parents were Yaccov and Rachel Heymann. Bertha was a member of the Blau-Weiß youth movement and trained for six months as a baby nurse in addition to studying for one year in a commercial school. Bruria then worked for five years as a clerk and also volunteered for five years as a secretary in the Jewish welfare office for foreigners and travelers. Between 1927 and 1929, she trained in social work at the Soziale Frauenschule in Berlin-Schöneberg. The topic of her final exam was \"Welfare Work for Impaired and Developmentally Disabled Children\" and she did her internship working with youth in Berlin’s Jugendamt, or children’s welfare department. Subsequently, she worked for three and a half years as a social worker in a home for at-risk girls. Bertha immigrated to Palestine in 1933 on her own, after her sister had gone to Palestine some time earlier to work as a midwife in Haifa. Bertha settled in Haifa as well. When she applied at the Vaad Leumi Department of Social Work in 1933, she received a very warm professional recommendation from Frieda Weinreich, another German-Jewish social worker who immigrated to Palestine, who knew her from the Zentralwohlfahrtsstelle der Juden in Deutschland (ZWST), or Central Office for Jewish Welfare, in Berlin. Later, Bertha headed a welfare office in Haifa and was in charge of the city's welfare department. Her husband was Dr. Zwi Avneri and they had two children, Yael Snapir and Shay Avneri. "]},"created":"1535040182","changed":"1587647028"},"1848":{"title":"Barak (Brock), Ruth (born Rosenthal)","fields":{"field_biography":["Ruth Barak (Brock) (née Rosenthal) was born on 2.6.1910 in Görlitz, Germany and died in Israel (year unknown). She did her training in social work at the ‘Soziale Frauenschule Berlin-Schöneberg, between 1930 and 1932. She immigrated in 1937 to Palestine and worked for the Tnuva factory (the national dairy company), then in 1947 worked with immigrants at the Hulon welfare office (List of Regina Schaechter at the CZA), in soldiers' welfare, and with the elderly. She retired in 1981 and lived in Ramat Gan (Modiin Street) in 1976, and in 1982 in Kfar Saba. "]},"created":"1535042725","changed":"1540221791"},"1871":{"title":"Bergman, Elisabeth (Lisbeth\/Elisheva) born Altman))","fields":{"field_biography":["Elisabeth (Lisbeth\/Elisheva) Bergman (née Altman) was born in 1900 in Düsseldorf, Germany to Hannah and Salli Altman and died in 1965 in Kfar Saba in Israel. In Germany, she was a social worker and a journalist focusing on social work issues. She lived in Magdeburg before immigrating to Palestine in 1933. Elisabeth was married to Eliezer Bergman, a doctor, and they had three daughters. In Palestine, she served as a librarian at a school for social work and established and headed an organization for the blind in Hasharon region and later in Kfar Saba. She published an article in 1963 about volunteering with the blind in the Saad Journal. "]},"created":"1535060499","changed":"1535060867"},"1876":{"title":"Bergmann, Dr. Emmy Mirjam (born Gruenwald)","fields":{"field_biography":["Dr. Emmy Mirjam Bergmann (née Gruenwald) was born on 15.9.1887 in Germany and died on 25.3.1972 in Israel. She was a pediatrician, and between 1915 and 1922, she worked in a private clinic, in a nursery school and later in a school in Berlin. She had trained with Dr. Langstein on the subject of childhood diseases, and she later researched and published papers on causes of infant mortality. Emmy incorporated a pedagogical approach in her medical work. In 1923, she studied Montessori educational methods and in 1925, she studied education in Frankfurt. Between 1925 and 1933, she led a Montessori kindergarten and school in Freiburg and published works about the Montessori educational approach. In 1935 she immigrated to Palestine. Emmy wanted to continue to work in the fields of education, social hygiene and medicine. She was trained in pedagogy at Ben Shemen, Mishmar HaEmek and Meir Shfeya youth villages. "]},"created":"1535062322","changed":"1562181447"},"1902":{"title":"Blank, Gertrud Sara","fields":{"field_biography":["Gertrud (\"Trude\") Sara Blank was born on 15.2.1892 in Hannover Germany and died in 1981 in Tel Aviv. She was the daughter of Sophie and Ely Blank, a merchant and manufacturer. Gertrud grew up with her aunt Emilie Levy, who probably died in 1911. One of her many siblings was Paula Blank, with whom she later lived in Tel Aviv. Gertrud attended the Soziale Frauenschule in Berlin-Schöneberg between 1913 and 1914, after which she worked as a social worker from 1915 to 1933 in the Wohlfahrtsamt or welfare office of Berlin-Charlottenburg, where she dealt with legal protection for minors, training of interns, and welfare work with needy minors and with psychotics. In 1932, she became a member of a Zionist organization. She was dismissed from her position in 1933 because she was Jewish, after which she worked as a social worker at the Zentralwohlfahrtsstelle der Juden in Deutschland (ZWST), the Central Office for German Jewish Welfare Berlin, where she worked together with Lucy Levy-Zobel. In 1934, she directed the Wohlfahrtsamt or welfare office of the Jewish community in Magdeburg. She also played a prominent role in the Jüdische Winterhilfe of Berlin, an organization providing relief to Jews in the winter between 1934 and 1939. Gertrud immigrated to Palestine in 1939, becoming a member of the Histadrut labor federation and Hitachduth Olei Germania, the Union of German Immigrants. In Palestine, she continued her social work, serving as a caregiver in a women’s social aid society from 1942 to 1943. From 1944 through 1948, she worked in the Ministry of Welfare, where one of her responsibilities was providing support for evacuees from Cyprus. From 1945, she also served as a senior caretaker providing social assistance for former soldiers. She continued working as a social worker in the Department of Child Social Services of the Ministry of Welfare from 1948 to 1957. Finally, in 1957, she became a volunteer member of the Association of Former Officers and Employees of Jewish Communities in Germany."]},"created":"1535828669","changed":"1540221715"},"1928":{"title":"Levy-Zobel, Lucy (born Zobel)","fields":{"field_biography":["Lucy Levy-Zobel (née Zobel) was born on 27.9.1898 in Berlin and died on 20.9.1960 in Jerusalem. In her youth, Lucy was a member of the Zionist youth movement and the ‘Seesen circle’. After attending the Soziale Frauenschule in Berlin-Schöneberg between 1920 and 1922, she worked as a social worker with juveniles at the Jewish welfare office in Berlin and between 1935 and 1937 at the Palestine Office, where she was in charge of approving the certificates. She was highly active as an author in the field of Jewish social work (especially in the journals ‘Jüdische Wohlfahrtspflege und Sozialpolitik’ and ‘Blätter des jüdischen Frauenbundes’). In 1938, she immigrated to Palestine with her husband Carl-Menachem Levy (1880–1958). Between 1939 and 1942 she worked at the department for youth aliyah of the Va'ad Leumi (Jewish National Council), and between 1942 and 1949 at the social welfare office in Givatayim. In around 1952 she headed the department for certificates at the Palestine Office, which was a facility of the Jewish Agency and organized the departure and entry of Jewish migrants to Palestine (Israel). In 1959, Lucy worked at the Israeli ministry of welfare."]},"created":"1535983346","changed":"1546613813"},"1935":{"title":"Boritzer, Regina ","fields":{"field_biography":["Regina Boritzer was born in 1909 in Lüben, Poland. The date and place of her death are unknown. She was the daughter of Isaac Boritzer, who immigrated to the United States in 1938 with his wife Berta. Regina never married. Between 1927 and 1930, she studied at a seminary for social pedagogy in Leipzig. In 1932, she was a social worker in Leipzig, and between 1933 and 1935, she worked as a social worker in the Jewish community of Leipzig, During this time, she maintained contact with illegal socialist groups. In 1936, she immigrated to Switzerland via France. There, she worked as a social worker and cared for refugees until 1949. She was active with the Swiss Association for Jewish Refugee Assistance, where she succeeded Thea Nathan as the main social worker in the association. During her time in Switzerland, she studied at the Institute for Applied Psychology in Zurich. She continued to support illegal immigration to Palestine, finally immigrating to Israel on her own (year unknown). In 1964, she studied at the London School of Economics. Regina was a member of the Hachalutz or pioneer, Zionist movement. In Israel, she was an inspector for family issues and headed the Jerusalem Department of Social Work. She was involved with the community department of social work at the Ministry of Welfare."]},"created":"1535985312","changed":"1539438726"},"1968":{"title":"Britschgi-Schimmer, Dr. Ina ","fields":{"field_biography":["Dr. Ina Britschgi-Schimmer (née Regina Schimmer) was born on 23.9.1881 in Vienna and died on 14.7.1949 in Israel. She was raised in a family from low socio-economic background. After school, she started working for commercial firms in Vienna and later Hamburg. Following the first Zionist congress in 1897, Ina got involved with the Zionist movement. She worked in administrative and editing work at the ‘Jüdischer Verlag’ – a Jewish publishing house which was formed in Berlin in 1902. In 1912, she married Dr Joseph Britschgi, a Gentile Swiss man, and the couple had two sons. They divorced in 1919, and Ina and her sons lived in Berlin first, before immigrating to Palestine in 1933. Paul Nathan, co-editor of the \"Nation\" and board of the \"Hilfsverein der Deutschen Juden\" and the \"Centralbureau für Jüdische Auswanderungsangelegenheiten\" commissioned her in 1906 with a study on the influence of the American immigration law on the Jewish immigrants to the United States. She did research on Ellis Island and at Jewish and Italian charities in New York. Since 1907 she studied political economy, sociology, philosophy and history in Berlin. From 1911 she studied constitutional, international and action law in Zurich. At the same time she was researching for her dissertation \"The economic and social conditions of Italian workers in Germany\" in steel factories of the Ruhr area, in Baden textile factories, and in Alsatian weaving mills. She developed new research methods, such as participant observation and oral history. From 1923 she was with the \"Berliner Zionistische Vereinigung\" and worked in the editorial office of the Hebrew newspaper Haolam, even when this was moved to London because of inflation. Then she edited the letters of Gustav Landauer together with Martin Buber. She was a member of the German WIZO, and in 1932 set up a counseling center for girls and women who wanted to emigrate to Palestine. To study the conditions there, she travelled to Palestine in 1932 and did not return after Hitler's accession to power. In Palestine, she worked for the Hitachduth Olej Germania. Later in Jerusalem, she devoted herself to social science studies, building on her work in Germany, for example in investigations for the Jewish Agency for Palestine: \"The Shifting of Jewish Immigrants from Germany to Urban Professions in Palestine\" (1936, 1940); \"Housing and Living Conditions in the Slums of Jerusalem\" (1939); \"Contribution to the History of the Chalukah and the Kolelim and their Economic Importance for the Present\" (1939); \"The Need to Build New School Houses in Jerusalem and Tel Aviv\" (1942); \"The Yemenite Jews in Jerusalem\" (1942); and \"Youth Aliyah in the Self-Contemplation of Young People\". She is a member of Aliyah Chadasha, and travels through Palestine for the latter study, interviewing youth in Kibbuzim, Kwuzot and Youth Villages. Between 1942 and 1945 she works for the \"American Fund for Palestinian Institutions\", then she retires. "]},"created":"1536157093","changed":"1539950091"},"1990":{"title":"Chayuth, Zvia (born Glick)","fields":{"field_biography":["Zvia Chayuth (née Glick) was born in 1908 in Jerusalem and died in 1995 in Israel. She was married in 1927 to an Austrian Jew who had immigrated to Palestine in 1923, and the coupled travelled to Vienna and returned to Jerusalem in 1929. In 1929 she gave birth to her first son, who eventually lost his sight and later died in a terror attack in 1943. She completed her diploma in social work at the University of Vienna in that same year. In 1934, her second son was born, and in 1937 she studied at the Siddy Wronsky School of Social services in Jerusalem, from which she graduated in 1939. The topic of her final paper was the Development of Modern Education for the Blind and its Influence on the Work in Israel. In 1944, Zvia published a book in Hebrew entitled Blindness and Blind People Around the World and In Our Country, based on a study she conducted in an institute for blind people in Jerusalem’s school for the blind, Beit Chinuch Ivrim. She then she travelled to Chicago in 1947 and completed her MA in social work. In 1960, Zvia published another study about services for the blind, and throughout the 1960s, she led the Israeli social services for the blind until her retirement in 1970. Additionally, Zvia was a board member of the Saad Journal, the official Israeli social work journal, from the 1950s through the1970s. She published articles in the journal in the memory of Siddy Wronsky, with whom she had worked closely. "]},"created":"1536271363","changed":"1536422392"},"2005":{"title":"Cohn, Else","fields":{"field_biography":["Else Cohn was born on 15 or 25.8.1900 in Luckenwalde, Germany and died in Israel. Else was a member of the ‘Jüdischer Frauenbund’ (Jewish women's union) and chaired the local Leipzig group with a focus on family welfare work. She was married to the rabbi Gustav Cohn, who was a cousin of Eva Cohn. Between 1921 and 1923, Else studied social work in Frankfurt and did practical training at several institutions for Jewish children's and youth welfare work, among them the Jewish children's home in Fehrbelliner Strasse, Berlin. From 1925–1935, Else was a social worker in the Jewish community in Berlin, headed the department for children's residential care (‘Erholungsheime’), cooperated with the ‘Jüdische Kinderhilfe’, headed one of seven welfare offices for the Jewish community in Berlin (family welfare work), acted as the manager and head of the volunteers at the office, worked with families, and did fundraising. In 1936, she immigrated to Palestine. From 1937 on, she worked at Histadrut and at the children's office in Tel Aviv. Later, she worked in Ramat Gan. In 1940, Else started work as a social worker in Tel Aviv and was a member of the women's workers union. Still in 1974, Else volunteered as a social worker with blind people."]},"created":"1536424629","changed":"1536579185"},"2007":{"title":"Cohn, Eva","fields":{"field_biography":["Eva (Chava) Cohn\/Cohen was born on 5.11.1903 in Berlin and died in 1971 in Jerusalem. She was the daughter of Oskar Cohn (1869–1934), a member of the German Reichstag who was both a socialist and a Zionist. When the Nazis came to power in 1933, he left Germany for Palestine, but only got as far as Switzerland, where he died in 1934. Chava's sister was Magda Cohn, also a social worker who also immigrated to Palestine. Chava graduated as an after-schoolcare provider (Hortnerin), was trained as kindergarten teacher and baby’s nurse at the Pestalozzi Fröbel House, and later in social work at the social women’s school Berlin-Schöneberg (1925-1927). Chava did her training in family and youth welfare and planned to work at Ahawah, the Jewish child welfare association in Berlin-Auguststr. Eventually she worked at the health centre for Jewish child refugees from eastern Europe, at the health department of Berlin city council, and she supervised children placed with foster families. She also worked for one year in the Bureau for the Protection of Young Girls. Fränze Rähmer, who was a chief German social worker in Prenzlauer Berg, was in a relationship with Eva's father, and Eva was in close contact with her before and after her immigration to Palestine. Eva also worked in Prenzlauer Berg until 1933. Another colleague of her was Vera Pulvermacher (married name Shiffman), who also immigrated to Palestine at that time. In 1933 Chava immigrated to Palestine. She started to work in Jerusalem with families and spent one year in an orphanage for Oriental children. In 1934 she started to work for the social work department of the Va'ad Leumi (Jewish National Council), in the field of child placement. In 1939 she was placed in Haifa, working under the children's immigration bureau of the Va'ad Leumi. She met child immigrants at ports, found suitable foster families and supervised the process. She became the leading social worker in Alyat Hanoar (the youth aliyah), and later worked in foster home monitoring in Jerusalem. In the spring of 1948, she returned to Berlin to organize children's immigration to Palestine\/ Israel, mainly from a Jewish orphanage in the Soviet sector of Berlin, near Fränze Rähmer's home. Chava was impressed by the communist environment and atmosphere in East Berlin, which – as a deeply convinced socialist, just as her father had been – she admired. "]},"created":"1536568662","changed":"1536934889"},"2038":{"title":"Shifman, Vera (Eva) (née Pulvermacher)","fields":{"field_biography":["<p><span>Vera Shiffmann (née Pulvermacher) was born in 1902 in Berlin and died in 1981 in Haifa. In Berlin, she lived in Warmserstrasse 12 (nowadays part of the KDW storage). Her mother and sister were sick and died by the time Vera was 21. Her father (Jack-Yaacov Pulvermacher) was a merchant for clothing. Vera studied kinder gardening at the PFH in Berlin, and worked in Prenzlauerberg with Eva Cohn, and she immigrated in 1933 to Palestine following Cohen. Vera's father followed her in 1934, and later established a hotel (Dolphin House) in Israel. In Israel, Vera worked in books editing and as a social worker in Haifa with immigrants (Einwandererheimes). Between 1935-1946 she headed the Merkaz Klita \"Geulim - Maon Oley Merkaz Europa' (immigration center for European immigrants) in Haifa, which was the first place immigrants came to in Palestine. She lived in Haifa (Achusa neighbourhood, Morad-Hazamir St), and was befriended with Henrietta Sold (youth Alyah) Zeev Glick (psychologist) and Hans Beyth from youth Alyah, where she volunteered after 1946 for many years. In 1951 she came back to Berlin to visit her relatives that survived and also applied for compensations and visited her old elementary school. Vera was married around 1935 to Nachum Munya Shifman. They had 2 children (daughter Ruth shifman-Alon and son Yoram shifman).<\/span><\/p> "]},"created":"1536696492","changed":"1574699341"},"2063":{"title":"Dajan, Yehudith (born Edith Sachs)","fields":{"field_biography":["Yehudith Dajan (née Edith Sachs) was born on 23.11.1913 in Berlin-Charlottenburg and died in 1996 in Israel. Her parents were Dr Hans Sachs, a medical doctor, and Anna Sachs, née Seligsohn. Yehudith attended the municipal women's school in Charlottenburg (1930-1932) and then started training in social work at the social-pedagogical seminary of the Verein Jugendheim (1932–1933). Yehudith was a member of the Social Democratic Party (SPD). Due to the National Socialist seizure of power, she was unable to graduate and immigrated to Palestine with her parents in 1933. For the first three years, she lived and worked in agriculture in Nahalal. Then, she lived in Kibbutz Ein Hashofet, working as a gardener on the field and with chickens. She was married to Yohoshua Dajan and they had three sons. "]},"created":"1536934958","changed":"1540221779"},"2081":{"title":"Danelius, Dr. Eva ","fields":{"field_biography":["Dr. Eva (Chava) Danelius was born on 1.3.1898 in Berlin and died in Haifa (year unknown). She was the daughter of Leopold Liepman Danelius and Else Danelius. She studied medicine and national economics at the universities of Berlin, Freiburg, Würzburg and Tübingen and did her PhD on the employment of partially incapacitated women. Additionally, she attended evening courses at the social welfare school of the Hochschule für Politik in Berlin and graduated as a social worker. She then volunteered to work with prisoners for two months. Between 1928 and 1929, she worked in a Jewish children's home in Norderney. She also was employed for one and a half years in the welfare and youth office of the Berlin-Friedrichshain to work with families. She subsequently spent three and a half years in different positions related to Jewish welfare work, including heading the vocational center of a Jewish welfare union in Wiesbaden and two years directing a Jewish provincial union for social work in Magdeburg, Sachsen-Anhalt. In 1933, she immigrated to Palestine. She worked for four months at Beit Chaluzot in Haifa. She later studied the Egyptian language at the Hebrew University in Jerusalem and attended courses on Coptic and Semitic languages, as well as on Biblical studies and history. She wrote articles on Velikovsky's reconstruction of ancient history, and also published articles in the Journal of Egyptian Archaeology (JEA) and in The Journal of Near Eastern Studies (JNES) among others. "]},"created":"1536940687","changed":"1539438531"},"2103":{"title":"Dukas, Dr. Rosa","fields":{"field_biography":["Dr Rosa Dukas was born on 2.2.1889 in Sulzburg, Germany and died on 15.1.1967 in Jerusalem. Initially, Rosa trained as a journalist. She worked as a teacher, and as a journalist at the Ullstein publishing company, both positions being in Berlin. She studied at the Universities of Freiburg and Berlin and earned her PhD in 1915. Between 1922 and 1933, Rosa lived in Berlin with her sisters and worked as a freelancer, e.g. on the ‘Jüdisches Lexikon’ (Enzyklopädisches Handbuch des Jüdischen Wissens). Between 1926 and 1931, she was the senior secretary at ‘Jüdische Waisenhilfe e.V.’, where she organized a large circle of sponsors for building Ben Shemen, the youth village founded by Siegfried Lehmann in Palestine. She attended lectures at the Academy for Social and Pedagogical Women's Work and took an external exam at the Soziale Frauenschule in Berlin-Schöneberg in 1932. She was politically active in the left wing (had relations to the KPD) and worked together with the Einstein family. Rosa Dukas immigrated to Palestine via Switzerland in June 1933. There, she probably worked in Ben Shemen. Between 1934 and 1939, she led a home for abandoned Oriental Jewish children in Mekor Chajim (closed in around 1939). Later, she worked privately as a teacher and in special needs education, and did free research work (e.g. a study about the habits and customs of south German Jews who lived in the countryside, which was funded by the German department of Sochnut, the Jewish Agency for Israel). "]},"created":"1536943124","changed":"1540222284"},"2172":{"title":"Ellern, Recha (Rachel)","fields":{"field_biography":["Recha (Rachel) Ellern was born on 2.12.1895 in Nuremberg and died in 1973 in Tel Aviv. She was engaged in social work and in teaching from an early age, mainly in Nuremberg. From 1914–1915, for example, she worked in an after-school day-care institution (Kinderhort) run by B'nai B'rith in Nuremberg, and from 1916–1919 she worked for the Mizrachi organization in Nuremberg, where she did youth welfare work, taught courses with historical, economical and sociopolitical subjects, and did statistical work and home visits. In the years 1919–1921, she voluntarily headed the Mizrachi youth home in Berlin, where she also taught. Recha took an external examination at the Soziale Frauenschule in Berlin-Schöneberg in 1922. Then, she worked as a social worker at the 'Israelitisch-Humanitäter Frauenverein' in Hamburg-Altona. During that time, the union was merged with the Jewish Settlement of Hamburg. Finally, Recha Ellern headed the social work department of the Jewish community in Hamburg, including a children's home. When the Nazis took power, she saved a lot of Jews in Hamburg from deportation. In 1938, she accompanied a Kindertransport to Palestine, where she stayed. In the 1950s, she was a main inspector at the department for research and planning at the ministry of welfare, and in 1959 she was involved in a community centre in the Hatikva neighbourhood in Tel Aviv. "]},"created":"1539612117","changed":"1541178144"},"2197":{"title":"Landauer, Georg","fields":{"field_biography":["<p><span><span><span><span><strong><span lang=\"EN-US\"><span>Georg Landauer<\/span><\/span><\/strong> was born on 17.11.1895 in Cologne, Germany and died on 4.2.1954 in New York, USA. Georg Landauer was a lawyer, journalist, and Zionist leader. He was active in the Zionist youth movement Blau-Weiss and the student organization Kartell Juedischer Verbindungen. He was a founder of the German branch of Ha-Poel Ha-Zair. Landauer became director of the Berlin Palestine Office in 1925 and in 1929 of the Zionist Federation of Germany. After his emigration to Palestine in 1934, he was involved in politics in the Yishuv, especially as founder of Aliyah Hadasha, a political party based by the German immigrant community, and in other immigration matters, particularly as financial director of Youth Aliyah. Landauer served twenty years (1934-1954) as a managing director of the Jewish Agency Central Bureau for the Settlement of German Jews. After the Second World War ended he was involved in negotiating for reparations and restitution of the property of German Jews in Germany. He emigrated to the United States in 1953.<\/span><\/span><\/span><\/span><\/p> "]},"created":"1540214729","changed":"1582886142"},"2221":{"title":"Kreutzberger, Dr. Max","fields":{"field_biography":["<p><span lang=\"EN-US\"><span><span>Max was a prominent German Jewish historian and social worker. He spent much of the 1930s in Palestine before eventually moving to New York in 1955. In Palestine he was a leading figure in the welfare office for German Jews in Jerusalem and Tel-Aviv (HOG), and between 1935-1948 became its general secretary. During his lifetime, he amassed a collection of over 10,000 pages on Palestine. After his immigration to the US, he is perhaps best known for becoming the first director of the Leo Baeck Institute, a research library for German Jewish history in New York. <\/span><\/span><\/span><\/p> "]},"created":"1541165238","changed":"1582886637"},"2244":{"title":"Feuchtwanger-Steinitz, Anna ","fields":{"field_biography":["Anna Feuchtwanger-Steinitz (née Steinitz) was born on 30.11.1878 in Gleiwitz\/Schlesien in Poland and died in 1942 in Jerusalem. She immigrated to Palestine in 1930. Anna was married to Eliezer Feuchtwanger. She was an educator and was active in Jewish orphanages in Germany. In Palestine, she headed a girls’ orphanage named Ohel Hannah Em Habanot located in Jerusalem and Tiberias and founded additional orphanages in later years. "]},"created":"1541249411","changed":"1541250283"},"2254":{"title":"Freund, Hilde ","fields":{"field_biography":["Dr. Hilde Freund was from Germany and her dates of birth and death are unknown. She probably studied law and later retrained to become a social worker. She was the first head parole officer for adults in Haifa in 1952. In the 1970s, Hilde worked in the Ministry of Welfare and headed a committee for treating girls with behavioral problems. "]},"created":"1541261811","changed":"1541261811"},"2256":{"title":"Freund, Lea (née Tachauer, married Fürst)","fields":{"field_biography":["Lea Freund (née Tachauer, married Fürst) was born on 10.10.1920 in Nürnberg, Germany and died on 8.5.2012 in Tel Aviv. She was one of four children of the famous Rabbi Alexander Tachauer, who was also an insurance agent and the head of the welfare department at the Jewish community of Nürnberg. Lea studied at the Jewish elementary school in Nürnberg, then attended a religious high school, and was a member of the Jewish youth movement Ezrah. She immigrated with her family to Palestine in 1933 and lived in Jerusalem until 1938. In 1935, she studied education at the Mizrachi movement teacher seminary. She left after three years without graduating, havinge decided that she did not want to become a teacher. At first, she served as a secretary for the religious youth movement Bnei Akiva in Tel Aviv. In 1940, she joined the Hagana and attended Siddy Wronsky's school for social service in Jerusalem. Lea started to work as a social worker in the Ness Ziona and Rechovot welfare offices in 1941. In the following year, she began working as a social worker in Tel Aviv with immigrants from Yemen. Her first husband was Schendor Fürst, whom she married in 1949 and with whom she had two children. Her second husband was Rabbi Gidon Freund. In 1957, she went to the University of Cleveland in the United States for two years in order to obtain a master’s degree in social work. Later, she became one of Israel’s leading social workers. In 1963, she began work as a supervisor of social workers at the Ministry of Welfare and was a lecturer at the Tel Aviv University School of Social Work. She was a highly active volunteer at the Emunah welfare organization and was a board member, manager and therapist at the Aluma center for family therapy. In addition, she was the founder and a board member of the organizations Shlomit for voluntary aid and civil service and Matav for welfare services for the elderly. She retired in 1985 but continued to volunteer in the aforementioned organizations. "]},"created":"1541262178","changed":"1576583325"},"2325":{"title":"Michaelis-Stern, Eva (born Stern)","fields":{"field_biography":["Eva Michaelis Stern (née Stern) was born in Breslau (Germany) on 29.12.1904 and died in 1992 in Jerusalem. She was the youngest of three children of Clara and William Stern, who was a professor of psychology and philosophy at the University of Breslau. In 1916, the family moved to Hamburg, where Professor Stern was appointed a professor of psychology and director of the Psychological Institute at the University of Hamburg. Eva’s brother, Günther, wrote under the pseudonym Anders, and was the husband of Hannah Arendt. The Stern family was steeped in German culture and far removed from Jewish life. After graduating from high school, Eva attended a two-year training program for gymnastics teachers. She then taught gymnastics in Hamburg and in Berlin, where many of her students were members of Zionist youth movements. Despite her parents’ objections, Eva became a Zionist and joined a Zionist youth movement. She was active in the Jewish settlement organization of Hamburg-Altona and visited Palestine for the first time in 1926. In 1928, she was invited to teach gymnastics at the Ben Shemen agricultural school in Palestine. Later, between 1928 and 1932, she worked at the Ahawah Jewish orphanage in Berlin. Eva co-founded and directed the Arbeitsgemeinschaft für Kinder und Jugendalijah, the fund-raising arm of the Youth Aliyah organization in Germany. From 1933 she worked in Nazi Germany under the eyes of the Gestapo, sending thousands of Jewish children to Palestine until she immigrated herself after an interrogation by Eichmann in 1938 together with her fiancé, Dolf (Adolf) Michaelis, a member of the Executive of the Zionist Federation of Germany. They were married in Jerusalem in March 1938. She moved immediately to London to head the Youth Aliyah office until 1945, where she helped hundreds of Jewish children escape from German-occupied countries and organized their passage to Palestine. Eva’s husband managed the Intria company, which had handled the transfer of funds from Germany to Palestine under a plan known as the Ha’avara agreement until the outbreak of World War II. After the war ended, Ilse and her husband returned to Palestine, where their son David was born. Eva served as the director of the International Relations Department of the Youth Aliyah organization in Jerusalem until 1952. After her retirement from Youth Aliyah, she founded the Hovevei Yerushalayim organization, which promoted civic improvement projects in the city of Jerusalem. In particular, it worked with youth from so-called “Oriental” families, or those who had come to Israel from Arab countries, in order to help make them good citizens. Ilse became active in AKIM, the National Association for the Habilitation of the Mentally Handicapped in Israel and in 1960 was appointed Chairwoman of its International Relations Department. She, together with Rahel Strauss, helped establish a sheltered workshop to provide employment for the mentally handicapped. She also worked together with Irene Gaster to found The Shield organization for mentally handicapped adults and later helped establish the Irene Gaster Hostel for mentally handicapped adults. In addition, she founded the Clara and William Stern Memorial Fund at the Hebrew University of Jerusalem to help train social workers to work with the handicapped. In 1980, she was honored by the Israel Ministry of Social Welfare for her accomplishments in the fields of saving children and aiding the handicapped. Eva Michaelis Stern was a frequent contributor to the German-language periodical Mitteilungsblatt published in Israel, and to other periodicals published in Israel and abroad. In 1989 she published a book entitled Emissaries in Wartime London, which included articles she had written for Mitteilungsblatt on youth aliyah during World War II as well as an essay by Dolf Michaelis on his work during the war. "]},"created":"1541967081","changed":"1547557105"},"2326":{"title":"Gaster, Irene ","fields":{"field_biography":["Irene Gaster was born on 13.6.1897 in London and died in 1977 in Israel. She was raised in a Sephardic family of 15 children. Her father was Moshe Gaster, a Zionist Rabi and well-known scholar of Roman and Slavic literature. Her mother, Lea-Lucy, was from a Jewish-German family. Irene did not graduate from high school and did not study a full-time course in her field of practice, but rather participated in several short-term courses and started working from a very early age with disabled children. During World War I, she attended a paramedic course and volunteered for the Red Cross nursing injured soldiers in a hospital near Bournemouth, England. When she was 19 years old, she started working in a boarding school as an educator of children with behavioural problems in Hampstead, London. In 1919, she moved to Ixworth and in 1920 to Bucharest, where she worked again with the Red Cross. Falling ill, she moved to Hamburg and later to Berlin, where she was treated at the Jewish hospital. After recovering, she returned to England at the age of 23 and completed a 3-month course run by the Mental Deficiency Committee. She worked for four years in a work centre for cognitively disabled people in Grangewood, Croydon. In 1928, she returned to Berlin and was asked to look after some children with cognitive disabilities. Soon, she established a small care centre in Werder, and later was invited to head the department for retarded women by the ‘Deutsch-Israelitischer Gemeindebund’ (German-Israeli community union) in Berlin-Weissensee (‘permanent residence for Jewish imbeciles’). Soon after the National Socialists came into power, she decided to immigrate to Palestine, first with a tourist visa. After consulting with Henrietta Szold, she moved to Jerusalem, volunteered at the KIAH School (Alliance) and later established the first home for cognitively disabled children. In 1938 she expanded the institution and moved to Ramat Gan. In the 1940s, she established the Ruchama home in Kfar Saba, which still exists today. Irene established the Magen NGO for cognitively disabled people and was also involved in the establishment of the AKIM NGO. "]},"created":"1541967086","changed":"1542027738"},"2366":{"title":"Isserlin, Margarete","fields":{"field_biography":["Margarete Isserlin was born in 1898 in Kassel, Germany to Helena and Siegfried Isserlin and died in 1953 in Tel Aviv. Margarete lived in Saarbrücken before immigrating to Palestine together with her parents in 1935, where they settled in Tel Aviv. She had two children. Margarete worked as a social worker in Palestine, first at the National Committee and later at the Jewish Agency's aid department for Jewish immigrants - Malban. "]},"created":"1542479963","changed":"1542564428"},"2367":{"title":"Samuelsdorf, Dr. Anni (born Weinreich)","fields":{"field_biography":["Dr. Anni Samuelsdorf (née Weinreich) was born on 31.7.1901 in Pinsk, then Poland, and died on 7.2.1972 in Tel Aviv. She was the daughter of Shaul Weinreich and Rachel Lurie, and the sister of Frieda Weinreich, Ismar Weinreich and Max Weinreich. She was well known as a Jewish social worker in pre-war Germany. From 1933 until she emigrated to Palestine in 1936, she was head of the Retraining Department of the Reichsvertretung. In 1957 the Hebrew university assigned Dr Samuelsdorf to help establish Friends organizations in different places in Germany. Then Felix Shinnar informed the university that all activities of Israeli public organizations would have to be approved by a special committee at the Ministry of Foreign Affairs in Jerusalem. Dr Samuelsdorf succeeded over the next 15 years in establishing societies of Friends of the Hebrew University in Berlin, Frankfurt, Düsseldorf, Hamburg, and Munich, which were headed by prominent figures in German academic and cultural life. "]},"created":"1542484313","changed":"1550662840"},"2368":{"title":"Ilanit, Fayge (born Hindes)","fields":{"field_biography":["Fayge Ilanit (née Hindes) was born in Brańsk (the Russian Empire, later Poland) on 7.2.1909 and died on 14.7.2002 in Israel. She was born to Sharaga Hindes and Hannah Shkop (daughter of Rabbi Shimon Shkop), and moved with her family to Ukraine in 1915 but returned to Poland in 1922. After her mother's death and her father's remarriage, she lived at her grandfather. In 1928 she joined Hashomer Hatzair and in 1929 she emigrated to Palestine. In 1933 she joined Kibbutz Gan Shmuel. She married Shlomo Ilan and in 1935 gave birth to her first child, who later died during his IDF service in 1955. Fayge was a Zionist activist and later an Israeli politician. She was active in the ‘Women’s Labour Council’ and a member of the secretariat of the ‘Women’s Labour Council’. She was a member of the central institutions of Mapai (the workers' party) and was active in the League for Friendly Relations with the Soviet Union. She was also a member of the Haganah. She was elected to the first Knesset for Mapai and was a member of the House and Education and Culture Committees. She opposed the Palestine Communist Party and rejected claims of anti-religious coercion in the immigrant camps. During her welfare activity she was supervised by Frieda Weinreich, about whom she wrote an article in the ‘Mitteilungsblatt’ (1965). In the 1940s she also wrote for the Dvaar Hapoelet socialist, feminist journal about the female worker in the moshavot."]},"created":"1542484390","changed":"1543178053"},"2414":{"title":"Jacobi, Grete (born Rabow)","fields":{"field_biography":["Grete Jacobi (née Rabow) was born on 23.1.1910 in Königsberg, Germany and died on 22.4.1973 in Tel Aviv. Her mother, Paula Rabow, was a singer and her father, Albert Rabow, was an insurance agent. Grete married Hermann Jacobi (1910-1988), an architect, in 1933 and they immigrated together to Palestine in the same year. They eventually had two children. Hermann became an advertising professional in Tel Aviv. Grete had received commercial training in Germany and worked as saleswoman in Palestine. She was a member of the Zionistische Studentengruppe (ZIST), the Zionist Student Union and of the Zionistische Vereinigung für Deutschland (ZVfD), the Zionist Association in Germany. Later, she worked as a secretary for the aliyah department of the ZVfD. In Palestine, she worked as a writer until 1944, after which she did volunteer work at the office for immigrant welfare under the direction of. Beginning in1948, she founded workshops for the elderly and for Mirjam Hoffert-Horani people with physical disabilities. Between 1958 and 1973, she was a social worker in Tel Aviv and worked with new immigrants. She was a member of Hitachduth Olei Germania (H.O.G.), the Aliyah Hadasha organization, the Progressive Party, the Independent Liberal Party and the Soroptimist International organization, (SI), a global volunteer organization advocating for human rights and gender equality."]},"created":"1542628261","changed":"1542659419"},"2433":{"title":"Jaffe, Dr. Ruth ","fields":{"field_biography":["Dr Ruth Jaffe was born on 4.12.1907 in Berlin and died in 1996 in Tel Aviv. She was born to a German-Jewish family. Her father, Alphons Jaffe (1881 in Berlin – 1948 in New York), was an industrialist and her mother was Alice (née Holländer, 14.2.1893 in Berlin – 15.8.1952 in Leukerbad, Switzerland). Ruth had a brother, Wolfgang, who died in 1926. She did her Abitur (university entrance level exam) in 1927 at the ‘erste städtische Studienanstalt’ in Berlin. She studied medicine in Freiburg, Vienna and (mainly) Berlin. She started her medical internship at Virchow hospital in 1933, but interrupted it because of political developments. She did her PhD in 1934 in Zurich on the fate of children with brain tumours. She returned to Germany and from there immigrated to Israel with her family in 1934, shortly after the imposition of the order that forced Jews to wear a yellow badge. In Israel, Ruth volunteered at the Hadassah hospital for two years. She describes her absorption as difficult: there were no language schools then and she had to learn Hebrew all by herself. She found it difficult to find work as a doctor, both because she was a woman and because of the large number of doctors who had immigrated from Germany at the time. In light of these circumstances, she underwent retraining and began to study social work at Siddy Wronsky's School for social service in Jerusalem from 1936, graduating in 1937 and writing her dissertation on incomplete families and their influences on child development. Later, between 1938 and 1943, she was the head of the social work department in Rishon Lezion, where a neighbourhood of Jewish refugees from Jaffa was established. In this context, she became interested in mental health problems. Afterwards, she went back to medicine and became a psychiatric nurse and a psychoanalyst working at psychiatric hospitals in Israel. During those years, she applied for personal analysis with Moshe Wolf, who was the founder of the Palestinian Psychoanalytic Society. Ruth started to work at Bitan Hospital, which gradually became a psychiatric institution in its own right (Shalvata Psychiatric Hospital). She encouraged the development and expansion of a multidisciplinary, team-based care system and its integration and decision-making, and also encouraged occupational therapy as part of the hospital and the invention of the concept of ‘patients by day, released every evening to their homes’. She was the one who in 1956 transferred Shalvata from Pardes-Katz to Magdiel, expanded its activities and established a children's hospital and youth clinic for day patients. In 1963, the hospital became the psychiatric department of the Tel Aviv University School of Medicine. From 1960, Ruth was a facilitator at the Institute and taught psychiatry at the Tel Aviv Medical School. In 1973 she retired and left her position as a director of Shalvata Hospital. After her retirement, she expanded her analytical work. In her article ‘Dissociative Phenomena in Former Concentration Camp Inmates’ (1968), she describes dissociative situations in which survivors of the inferno of the camps and the war relive the trauma they have experienced, claiming that these are not hysterical phenomena but dissociative situations caused by events that, because of their incomprehensible power and quality, cannot be integrated by the ego. Her article ‘Activity as a Defense Method in Concentration Camps’ discusses the possibility that group organizations served as a defence mechanism that helped cope with the intolerable reality of life in the death camps. "]},"created":"1542671509","changed":"1542977024"},"2465":{"title":"Kalinhoff, Gabriele (born Feuchtwanger)","fields":{"field_biography":["Gabriele Kalinhoff (née Feuchtwanger) was born on 23.8.1906 in Frankfurt and died on 13.1.1989 in Ramat Chen, Israel. She was the daughter of Dr Albert Feuchtwanger (a medical counsellor). Gabriele was a member of the ‘Blau-Weiss’ youth movement. In Germany, she lived in Berlin-Charlottenburg. In the spring of 1933, she got married to Gershon Kalinhoff, an electrician, and the couple immigrated to Palestine in that same year. They had two children. Gabriele trained between 1923 and 1924 in Frankfurt as an after-school care provider (‘Hortnerin’) and later worked at the Jewish children's home on Norderney before studying at the Soziale Frauenschule in Berlin-Schöneberg between 1926 and 1928. In 1926 she did an internship at the Frankfurt welfare bureau. After her studies, from 1928, she worked for Berlin city council as a social worker. In January 1933, she was dismissed from her position and immigrated to Palestine. From 1933 until 1949, she worked with her husband at the family's electrical supply store in Haifa and raised their two children. In 1949, Gabriele started to work as a social worker at the municipality of Haifa, a job she held until the 1960s. She worked in Wadi Rusheima, Halisa, and south of Haifa (today Kiryat Spernizk). In 1962, the couple moved to Ramat Chen. In the late 1960s\/early 1970s she was invited to Germany twice: as a former state worker, and as a former citizen of Frankfurt."]},"created":"1543180183","changed":"1543183546"},"2511":{"title":"Katz, Liselotte ","fields":{"field_biography":["Liselotte Aliza Katz was born on 25.5.1904 in Kassel, Germany. She studied in a commercial high school in Kassel and worked as a secretary for two years in a commercial firm. Following this, Liselotte worked for one year in a Jewish orphanage in Hamburg and received household management training in preparation for her social work studies. She attended the Soziale Frauenschule in Frankfurt am Main around the years 1926 through 1927, where she was trained as a social worker, with an emphasis on economic and occupational welfare work. At the end of 1929, Liselotte immigrated to Palestine. During her first year in Palestine, she lived in Tiberias, studying Hebrew and learning about the country. She then moved to Jerusalem and worked as a volunteer in kindergartens, among them the Histadrut kindergarten in the Shimon HaTzadik neighborhood in East Jerusalem, and a summer camp of Histadrut Nashim, the Women’s Workers Union, located in Jerusalem’s Talpiot neighborhood. She later volunteered as a social worker at Histadrut Nashim and at the welfare office of the Jerusalem municipality under Zipora Bloch. She also devoted time to studying Arabic. "]},"created":"1543437145","changed":"1543437243"},"2532":{"title":"Katzenstein, Jenny ","fields":{"field_biography":["Anna Jenny (Jenya) Katzenstein was born on 12.7.1903 in Hersfeld\/Hessen to Wilhelmine Martha and Julius Katzenstein and died in Israel (year unknown). Her parents were Julius (born 7.2.1880 in Elberfeld) and Wilhelmine Martha (born Paschhoff). Jenny had two sisters. Between 1920 and 1921, Jenny attended the household management school of the Israeli humanitarian women's union in Segeberg. She then worked in the business sector for two and a half years before spending three years working in the educational field. From 1926 through 1928, she completed the full course of social work studies at Soziale Frauenschule Berlin-Schöneberg. She interned in a home for orphans in Berlin, the Waisenerziehungsanstalt des Frauenvereins directed by Ida Heinrich. She had another internship at a Jewish recreational center of B’nai B’rith in Dresden. The topic of her final paper was “Educational Thought in Modern Juvenile Criminal Law.” Later, she immigrated to Palestine in 1936 or 1937 and worked for two months in 1937 in the Department of Social Work of the Haifa municipality, having been highly recommended by Jenya Twersky, another German-Jewish social worker in Palestine\/Israel. "]},"created":"1544455280","changed":"1544459108"},"2552":{"title":"Keren, Miriam (born Marianne Mayer)","fields":{"field_biography":["Miriam Keren (née Marianne Mayer) was born in 1907 in Berlin and died in 2009 in Israel. Her father, Richard Mayer, was a Zionist lawyer employed by a bank. Her family had lived in Germany for many generations and was both religious and Zionist. Miriam was a member of the Blau-Weiß youth organization and studied history and English language and literature at the University of Heidelberg and then at the University of Berlin. In 1928 she married Erich Kraemer, who changed his name to Moshe Keren in Palestine. He was a banker and later worked as a journalist for Ullstein publications in Germany and later for the for the Haaretz newspaper in Palestine\/Israel. The couple immigrated in September 1933 to Palestine, settling first in Haifa. Their first child, Michael Keren, who would become a professor of economics, was born in 1931 and their daughter Yehudith was born in 1936. In 1948 Miriam studied social work in a special course conducted by the Jewish Agency, and then worked with Jewish immigrants in Yehud. She subsequently she worked in the prestigious bookstore of her uncle, Ludwig Mayer. When her husband registered for the British Army in 1941, Miriam moved to Ramot HaShavim, where she cared for her children and worked as an English teacher. Later, she moved to Ra’anana. Moshe was then sent on a diplomatic mission to Washington, D.C., where the family lived for two years, followed by two years in London between 1951 and 1953. There, Miriam continued her social work studies. After the family’s return to Israel in 1953, Miriam began working with immigrants through the Department of Social Work of the Tel Aviv municipality, where she continued to work for over ten years. She also ran a home for immigrants. In 1968, she moved to the Beit Meir retirement home in Jerusalem, where she also volunteered to work with the residents."]},"created":"1544459185","changed":"1544636644"},"2596":{"title":"Hirsch, Hannah (née Krayn)","fields":{"field_biography":["Hannah Hirsch (née Krayn) was born on 16.12.1902 in Berlin to Ida and Phillip Kreyn and died on 02.07.1975 in Israel. Although her family was assimilated, at the age of 12, Hannah joined the Blau-Weiß Zionist youth movement. Deeply influenced by the Russian revolution, she became an active member of the Communist Party and only the rise of Hitler's brought her back to Zionism. Hannah had hoped to become a kindergarten teacher but this was not possible for financial reasons. Instead, she became a typist. From 1924, she worked as a housekeeper and as a caretaker for children. In 1926, she completed a three-month course to become a baby nurse in Dr. Neumann’s Kinderhaus in Berlin while also attending evening courses in psychology in at the Berlin Association for Individual Psychology with Fritz Künkel and Manes Sperber. In addition, she studied special education at Horst\/Ostsee and volunteered in Annemarie Wolff’s individual psychological orphanage in Berlin. After her work at this orphanage, she decided that she wanted to establish an orphanage in Palestine together with Sophie Kahan-Nagler Faiöled. Hannah had already completed her hachshara, or training in 1923 and wanted to immigrate to Palestine in 1926 but was not able due to an error in her name on her training certificate. Finally, Hannah was able to immigrate to Palestine in 1933. She first lived in Tel Aviv, where she worked as the secretary of Chaim Arlozorov. She then lived on Kibbutz Merchavia for a year and a half, after which she left the kibbutz to open an office for administrative work. Around 1934, Hannah married Hermann Hirsch, a German-Jewish agronomist, and they had three daughters, Yehudith, Rachel Rochberg and Miriam, and 12 grandchildren. Hannah succeeded in her office work but her health suffered from living in the city. As a result, the family moved to a small farm in Haifa Bay, where they did agricultural work and ran a restaurant. Even this environment became increasingly urban, so the family decided to join Kibbutz Kinneret near the Sea of Galilee as part of \"From the City to the Village\" movement. There, Hannah worked in different jobs, especially on the knitting machine. Hannah applied for a social work position in 1934 but never officially worked in this capacity. She was a good psychologist and graphologist and worked in these areas unofficially and voluntarily at her home with her daughters and with youth from the Youth Aliyah organization. She also adopted two boys who were Holocaust survivors. "]},"created":"1544894356","changed":"1578743153"},"2628":{"title":"Landau-Mühsam, Charlotte (born Mühsam)","fields":{"field_biography":["Charlotte Landau-Mühsam (née Mühsam) was born on 20.9.1881 in Lübeck and died in 1971 in Israel. She was the daughter of Siegfried Mühsam and Rosalie (née Cohn), and sister of Hans Mühsam, a doctor who chaired the Jüdischer Volksverein Berlin-Grenadierstr., which provided inexpensive housing for Jews from Eastern Europe. He was also the husband of Minna Adler, who headed the children's soup kitchen of the Jüdischer Frauenbund (JFB), which later became the Ahawah orphanage. Hans and Minna eventually immigrated together to Haifa in Palestine. Charlotte's other brother was the noted anarchist writer Erich Mühsam. Charlotte married the lawyer Leo Landau in 1908, and they had three children. From 1918, Charlotte chaired the City Association of Women Unions of Lübeck, where she was very involved with feminist issues. She also became a member of the German Democratic Party and served as a lay judge and a jurywoman. From 1923, she served as a board member of the JFB, where she gave strong expression to her Zionist world view. She helped to found a home for children with tuberculosis in Wyk\/Föhr, where she also worked as a social worker and chaired the working committee of the home and cooperated with the B'nai B'rith Order, the Israelitischer Gemeindebund, or the Israel Community Organization, the Zentralwohlfahrtsstelle der Juden in Deutschland, or Central Welfare Office of German Jews, and the Zionist Union. Charlotte travelled together with her husband to Palestine for the first time in 1925. There, they befriended the well-known artist Hermann Struck, who helped them to immigrate and settle in Haifa in 1933. Once in Palestine, Charlotte worked mainly as an artist. Her husband Leo founded Agudat Achim, an association to aid German immigrants. Charlotte did engage in some voluntary social work. She founded a self-help association for women called a union named Saad, a self-help-association for women. When the Ahawah orphanage moved to Palestine, she became a board member and helped a great deal to build and establish the home. Charlotte wrote her memoirs in two parts: the first in 1931 in Lübeck, and the second in 1951 in Haifa."]},"created":"1545519506","changed":"1546182775"},"2648":{"title":"Levi-Altman, Margot (born Altman)","fields":{"field_biography":["Margot Levi-Altman was born on 5.11.1902 in Poland and died in 1956 in Israel. The Altman family lived in Breslau in a large five-room apartment and led a bourgeois, non-religious Jewish life. Margot was a good student and the only one of her siblings who studied in a Gymnasium, passing her matriculation exams in 1921. She had a strong command of classical German literature and knew hundreds of poems by heart. She also wrote her own poetry and stories, and was an accomplished musician, playing flute and guitar. Margot was a member of the Kameraden, a Jewish youth movement. After completing her matriculation exams, she studied at a teacher training seminary and was certified as a teacher in 1923. She never worked within a formal school structure, but instead began to educate children of Jewish families privately. During the second half of the 1920s, she moved to Munich, where she studied child psychology and psychotherapy, and later worked as a therapist at the Hecksher Hospital and Research Institute. After the Nazis came to power in 1933, she was dismissed from her job, at which point, the Zionist chapter in her life began. She moved to Berlin, was hired by the Jewish orphanage Ahawa and immigrated to Israel in 1935, where she worked as a youth group leader at Kibbutz Givat Brenner. One year later, she moved to Jerusalem and began working at the Irene Gaster Children's Institute. In the summer of 1937, she met Dr. Mordechai Levi, whom she married. Her young family moved to live in the \"small house\" between the Jerusalem neighborhoods of Arnona and Ramat Rachel in 1941. Margot worked in the nearby children’s center Armon Yeladim (children palace), caring for children in the community. She also founded the B'nai B'rith Institute for the Children from Teheran. In 1944 the family moved to Haifa and Mrgot worked at Hadassah's counseling and therapy center in Hadar Hacarmel. In 1951, she stopped working at Hadassah and worked in private practice."]},"created":"1546182967","changed":"1546256663"},"2696":{"title":"Lewin, Mirjam (born Levy)","fields":{"field_biography":["Mirjam Lewin (née Marianne Levy) was born on 10.3.1909 in Berlin. The place and date of her death are unknown. She was the daughter of Katharina\/Käthe Dr. Ernst Levy, a lawyer and notary. Before her immigration to Palestine, Marianne lived in Berlin-Charlottenburg. In 1927, she attended a domestic science school of a children's home, Zion Lodge, in Norderney. Between 1927 and 1929, she trained as kindergarten teacher at the Pestalozzi-Fröbel-Haus in Berlin. Following the completion of her studies, she worked as an assistant in the afterschool care of the Jewish community Adaß-Jisroel, was the head of a private kindergarten and worked in Jewish children's homes in Berlin. Beginning in 1932, she attended the Soziale Frauenschule in Berlin-Schöneberg, but left the school in 1933 without graduating due to health reasons. She interned in several places, including a Jewish holiday home nearby Königsberg belonging to the B'nai B'rith Order and at the Zentrale für private Fürsorge, the Central Office for Private Welfare in Berlin. She immigrated to Palestine in the summer of 1933. There, she worked as a kindergarten teacher in Tel Aviv and Jerusalem between 1933 and 1939, and later as an employee at the Hapoel Hamizrachi women’s movement. She established a religious kindergarten in Eilat, and was an active member in the Hapoel Hamizrachi organization. In addition, she wrote articles about pedagogy and education. In 1946, she married Erich Lewin. "]},"created":"1546618287","changed":"1546622767"},"2716":{"title":"Lewin, Yehudith (born Margolin)","fields":{"field_biography":["Yehudith Lewin (née Margolin) was born in 1907 in Jaffa, Palestine to a family from Odessa. She was married to Aminadav Lewin. Yehudit's granddaughter is the famous writer Yehudith Katzir, who wrote a Hebrew biography about her. Yehudit Lewin studied education in Tel Aviv in 1927 and worked for one year with Yemenite girls and adults. In 1928, she moved to Berlin, where she was trained to work in kindergartens, schools, nursery schools and orphanages. After 1929, she studied in a school for household management, after which she worked with several Jewish institutions in Berlin. These included the Verein Jugendheim-Charlottenburg, where she taught, Berlin’s Jugendamt, and other institutions. After returning to Palestine, she studied social work at Siddy Wronsky’s School for Social Sevices in Jerusalem in 1942. Yehudit published some papers on issues in social work and worked at the welfare office in Kiryat Ata. "]},"created":"1546702683","changed":"1546779412"},"2759":{"title":"Lowitsch, Mirjam (born Margolinski)","fields":{"field_biography":["Edith Mirjam Lowitsch (née Margolinski) was born in 1913 in Berlin and died in 2008 in Israel. Her parents were Frieda and Siegfried Margolinski, who was a lawyer until his dismissal in 1935 due to the Nazi regulations. Edith’s family was not religious, and she received her matriculation certificate in 1931 in Berlin. She initially wanted to study mathematics, but soon went to work at an insurance association. From 1934, she received agricultural training in Belzig, Germany and later in Memel in Lithuania. From Lithuania she returned to Berlin, where she studied child care and worked in administration. Having been trained as a baby nurse, she worked with Jews from Eastern European countries at the Ahawah orphanage. She also held a number of other positions, including that of a baby nurse and at Ha'awara, a housekeeper and a dance teacher. She married Helmut F. and immigrated with him to Palestine in October 1935. They first lived in Kibbutz Givat Brenner, where Edith worked with children, but they eventually had to leave the kibbutz due to political conflicts, moving to Tel Aviv. Helmut volunteered to serve with the British military in 1940, after which the couple divorced and Edith raised her son alone. In 1954, she married Kurt Lowitsch. She was affiliated to the Hitachduth Oley Germania, the Union for German Immigrants, in Tel Aviv, Edith lived near social worker Ilse Cohn for a while, and later worked with the juvenile court judge David Reifen. "]},"created":"1546795702","changed":"1546893609"},"2790":{"title":"Mainz, Bertha ","fields":{"field_biography":["Bertha Bracha Mainz was born in 1901 in Halle, Germany to Jenny Schloss and Michael Löb Mainz and she grew up with eight brothers and sisters. She trained in a Jewish household management school, from which she graduated as an institutional clerk, or Anstaltsbeamtin, receiving state certification in 1925. Additionally, she received some non-formal training engaging in practical social work, having worked in several youth welfare institutions, such as the children's day home of a Jewish women's union in Cologne, a orphanage in Leipzig, the welfare department of the Jewish community in Düsseldorf, a girl's orphanage in Kassel, and in a Jewish settlement in Hamburg-Altona. In addition, she was a member of the religious Mizrachi movement in Germany. In May 1935, she applied for a job with the Youth Aliyah program in Jerusalem, then led by Henrietta Szold. Bertha immigrated to Palestine in April 1936 and lived in the Rechavia neighborhood of Jerusalem. In 1956, Bertha worked at the Women’s International Zionist Organization (WIZO) in Jerusalem. "]},"created":"1547045222","changed":"1547056120"},"2808":{"title":"Mamout, Gisela (born Rigelhoft)","fields":{"field_biography":["Gisela Mamout (née Rigelhoft) was from Germany and her dates of birth and death are unknown. She had one daughter from her first marriage and her second marriage was to Gad (Moutschi) Mamout. In 1944, the couple had a second daughter. As a young woman in Berlin, Gisela worked in the Jewish orphanage Ahawah. She was trained as a kindergarten teacher and later studied special education in Israel and worked in special education in Kibbutz Givat Brenner. "]},"created":"1547056228","changed":"1551598803"},"2817":{"title":"Maor, Gila  (born Reifen)","fields":{"field_biography":["Gila Maor (née Gisela Reifen) was born in 1913 in Plauen, Germany and died in Israel (year unknown). She was raised in a Hassidic family and managed to leave for Palestine in June of 1933, just a few hours before the Gestapo came looking for her. Her parents and siblings were supposed to follow her soon thereafter, but the family was murdered in the Holocaust. Only one of her relatives, David Reifen, immigrated to Palestine and worked the area of youth law and welfare. Gila married Harry Maor, originally from Munich, in 1939. He was a teacher of religion and worked as social worker in Haifa for a short period. Like her husband, Gila frequented cafes for left-leaning intellectuals. In 1942, the couple moved to Tel Aviv, where they had two children, Eleanor, named after Karl Marx's daughter, and Maimon, named after Harry's younger brother, who had remained in Germany and died in the Holocaust. In the 1950s, the family returned to live in Germany to enable Harry to obtain his PhD. Harry led the Zentralwohlfahrtsstelle der Juden in Deutschland (ZWST) in Berlin and Gila worked in anthroposophist kindergartens and as a child caregiver for Jewish-German families. After Harry’s death, Gila, together with psychologists and therapists, founded the group Lavav for single adults coping with mental disabilities and seeking partners in life. "]},"created":"1547129236","changed":"1547129236"},"2820":{"title":"Meyer, Käthe ","fields":{"field_biography":["Käte\/Käthe Meyer was born in Germany (year unknown) and died in Israel (year unknown). In her youth she lived in Berlin. Between 1920 and1921 she attended a full course in social work at the Soziale Frauenschule, the social women's school in Berlin-Schöneberg. After completing the course, she worked from 1921 through 1922 at the Komittee Kinderhölle in Berlin, an organization which gave economic aid to German children and families. She subsequently did administrative work for the Prussian Union of Jewish communities between 1925 and 1927. She then held a position of responsibility as a social worker. Between 1927 and 1933 she worked as a social worker in a welfare office in Berlin-Mitte, dealing primarily with family welfare. In 1933, she immigrated to Palestine, where she first worked as a secretary for a short while in the Hitachduth Olei Germania, the Union of German Immigrants, in Tel Aviv. She applied to work as a social worker with Henrietta Szold in 1934. "]},"created":"1547250094","changed":"1547422313"},"2861":{"title":"Müller-Cohen, Anitta (born Rosenzweig)","fields":{"field_biography":["Anitta Müller-Cohen (née Rosenzweig) was born on 6.6.1890 in Vienna and died on 29.6.1962 in Tel Aviv. Born into a well-to-do Viennese merchant family, Anitta was brought up in a prosperous, assimilated home. Even in her youth, she became interested in social work and in the women’s movement. Anitta managed to continue her public involvement and at the same time raise her four children. After the outbreak of World War I, she founded the organization ‘Soziale Hilfsgemeinschaft Anitta Müller’, which ran several social service institutions (such as tea and soup kitchens) for homeless people, children, mothers and refugees. She was particularly committed to Jewish refugees from Galicia and Bukovina. At the same time, she became involved in Zionism and politics, joining the Jewish National Party in Vienna and becoming one of its leading members. Besides her social and political engagement, Anitta Müller-Cohen published a vast number of articles in various Jewish and Gentile newspapers. She was appointed to the first City Council of Vienna after World War I, in 1918–1919. In the twenties, she continued her social, political and Zionist activities, visiting Palestine several times, and also the U.S.A., where she addressed the opening session of the American Jewish Congress in Chicago in 1925. She was also involved in the Jewish women’s movement and attended the first World Congress of Jewish Women in Vienna in 1923 and the second one in Hamburg in 1929, when she was elected as one of the vice-presidents of the newly founded World Federation of Jewish Women. In those years, together with Nadia Stein, she founded the ‘Women's International League for Peace and Freedom’. Anitta Müller-Cohen and her family moved from Vienna to Luxembourg and London and finally, in 1935, to Tel Aviv, where she continued her social activities. During and after World War II she concentrated her efforts on children and new immigrants, particularly those from Austria, establishing a special service for Austrian refugees, the Hitachdut Oley Austria (Association of Austrian Immigrants). In 1936 she founded the Women’s Social Service (Sherut Nashim Sozialit) and played a prominent role in the Mizrahi Women’s Organization. In the 1950s, she left the Mizrahi movement and joined the Herut party. She attended several Zionist congresses, and at the twenty-fourth Congress in 1956 was elected a delegate-at-large to the Greater Actions Committee. In her last years she lived a very secluded life, due to a serious illness. In 1965 a home for Austrian Jews was named after her in Ramat Hen. "]},"created":"1547557218","changed":"1601551619"},"2887":{"title":"Nahmani, Irene (born Fried)","fields":{"field_biography":["Irene (Irena) Nahmani (née Fried) was born on 18.9.1910 in Berlin and died on 20.2.1996 in Kibbutz Afek, Israel. Her father was Christian and her mother was Jewish. She studied at the Sozialpädagogische Seminar of the Verein Jugendheim in Berlin-Charlottenburg; between 1930 and 1933 (Jugendleiterinnenseminar), and worked in an orphanage and with deaf children. She immigrated to Budapest and returned to Berlin before her immigration to Palestine in 1936. She was married to Gerhart Gabriel Nahmani, who was a librarian. Irene worked as a kindergarten carer in Kibbutz Afek, and later founded a children and youth club funded by the youth aliyah for child refugees. "]},"created":"1547766063","changed":"1548021423"},"2897":{"title":"Nathan, Else ","fields":{"field_biography":["Else Sophie Nathan was born on 17.8.1895 in Koblenz and died in Israel (year unknown). Else completed her matriculation exams in 1911 and later studied languages. Around 1913, she attended a course in business school in Koblenz. She was also an active member of the Jewish youth union in Koblenz and later founded the Jung-Jüdischer Wanderbund, a Jewish youth movement in Bonn. Between 1913 and 1914, she studied household management in a boarding school in Strasbourg and was also a visiting student at the University of Strasbourg, attending courses in the history of literature, philosophy, social hygiene and experimental psychology. Between 1914 and 1916, Else did practical work as a Hortnerin, or daycare provider, at the public Drachenschule in Strasbourg. She then worked in a Comenius kindergarten seminary in Koblenz between 1917 and 1917. She then headed a private kindergarten in Koblenz. Her special interest was psychopathology, and between 1919 and 1920, she studied social work and trained to be a Jugendleiterin, or youth leader, at the Jugendheim Charlottenburg in Berlin. She did her internships in different welfare institutions, including a public welfare office and a school. Beginning in 1920, she was employed as social worker by the Berlin municipality to work with youth at the Jugendamt, or youth welfare office. She began studying in the full social work program at the Soziale Frauenschule Berlin-Schöneberg. Although she studied for nine months without graduating, she did receive state accreditation as a social worker in 1924. She continued working at a welfare office in Berlin-Mitte, and while she eventually worked in nearly every aspect of public welfare work, she tried to work with Jews in particular. She was a visiting student at the University of Berlin and attended courses in psychology, psychopathology of youth, the theory and history of worker's movement (Sombart) and social hygiene (Grotjahn. Between 1933 and 1936, she worked as an immigration counselor at the Palästina-Amt, an organization for helping Jews to immigrate to Palestine. There, she established an archive on life in Palestine, based on her own two-month visit there. In 1938 she began working as an immigration counselor in a leading position at the Hilfsverein der Juden in Deutschland, a relief organization devoted to improving the conditions of Jews. She immigrated to Palestine in 1939 with economic assistance from the Jewish Agency. Between 1941 and 1949 she worked in the Ben Shemen Youth Village. She made it a practice to visit the relatives of the children from the Youth Village in order to understand their economic situation and to collect pedagogical materials on the development of the children. She also took on fundraising responsibilities for the Youth Village. From 1950, she did administrative work in the Israeli Ministry of Welfare in Jerusalem. According to a 1961 newspaper article, she was one of the most well-known and experienced social workers in Israel. "]},"created":"1548021660","changed":"1548021660"},"2917":{"title":"Neumark, Irma ","fields":{"field_biography":["Irma Neumark was born on 25.5.1904 in Poznań, Poland and died in Israel (year unknown). First she attended the Strahlendorf commercial school in 1921\/22, then she worked as a secretary until 1927. Between 1927 and 1929 she was trained as a social worker at Alice Salomon's Soziale Frauenschule in Berlin-Schöneberg. Later, she studied at the ‘Deutsche Akademie für soziale und pädagogische Frauenarbeit’. She worked mainly in the field of residential care and recreational work with children, e.g. at the Jewish children's homes in Norderney and Arendsee. After immigrating to Palestine in 1933, she worked in other fields and finally retrained as a nurse in 1946. She lived in Haifa. "]},"created":"1548414826","changed":"1548420875"},"2937":{"title":"Ochs, Gerda (born Rau)","fields":{"field_biography":["Gerda Zippora Ochs (née Rau) was born on 1.4.1909 in Berlin and died on 26.11.1999 in Israel. She was the youngest of eight children of the Rau family. Her father Raphael worked as a physician in Berlin until the Nazis’ rise to power. Her elder brother Arthur (Aharon) ran the German branch of the Palästina-Amt, an organization for helping Jews immigrate to Palestine, after having been dismissed from his position as a judge when the Nazis seized power. Another brother, Heinz Rau, an architect and city planner, was one of the leaders of theInternational Style architectural movement in Israel and one of the pioneers who planned modern Jerusalem in the early years of the state. Gerda studied law at the University of Berlin and married Rabbi Dr. David Ochs. The couple moved to Königsberg before moving to Leipzig in 1936, where David worked as a rabbi. Gerda was very engaged in the Leipzig Jewish community and worked to help save endangered Jews during the 1930s. She served as Chairwoman of Leipzig’s Brit Halutzim Dati'im, the Union of Religious Pioneers, a religious youth movement, until she left Germany at the end of 1938. The day after Kristallnacht, David was arrested by the Gestapo and was sent to Buchenwald. After his release, the couple moved to London. At the beginning of 1939, they immigrated to Mandatory Palestine and settled in the religious youth village in Kfar Hasidim. There, Gerda worked as a guide, storekeeper and house mother of the immigrants' home, which included orphans from Frankfurt. She later served as national supervisor for the children of the religious Youth Aliyah movement. In 1946 the couple moved to Tel Aviv, where David served as the rabbi of a religious youth group in addition to pursuing his educational activities. Gerda was one of the founders of Reut Social Women's Service, one of Israel's oldest and largest welfare and health organizations, which was established to help Holocaust survivors who came to Israel. Among Reut’s numerous projects were a rehabilitation hospital for victims of diseases, accidents and terrorist attacks, long-term hospitalization services, protected housing for the elderly, Holocaust survivors and immigrants from disadvantaged backgrounds, nursing homes and social activities for seniors. After serving for many years as a Reut board member, Gerda was recruited by Paula Burt, the founder of the organization, and served as Chairwoman of the Association. Gerda also served as Chairwoman of the Lichtenstater Hospital, now named the Reut Medical Center. In her last years, she moved to the Burt House in Jerusalem, continuing her voluntary activities with Reut, and later with Yad Sarah, a national volunteer organization providing health equipment and services. In 1989, Gerda was awarded the title of \"Honorary Citizen of Tel Aviv.\" "]},"created":"1548420981","changed":"1548542572"},"2961":{"title":"Lotan, Hilde (Born Cohn, Hildegard)","fields":{"field_biography":["Hildegard (Hilde) Lotan (née Cohn) was born on 30.5.1902 in Nuremberg and died on 10.1.1983 in Jerusalem. She received her professional training by 1924 at the School of Social Work in Munich, where she also managed the social work department between 1928 and 1931. Afterwards, she moved to Berlin, married Georg Lubinski (Dr Giora Lotan, a judge and a well-known welfare activist in Germany and Israel), and worked there as a social worker in children's institutions. They emigrated to Palestine in 1938, and had 3 children. Between 1944 and 1945, Hilde worked at ‘Palestine Potash Limited’, and later worked as a probation officer with the British authorities. She was the coordinator of the Rehabilitation station for immigrants requiring help with becoming fit for work at the Jewish Agency (MALBAN), was a consultant for the social work department in the Tel Aviv Municipality, and an instructor at Siddy Wronsky's school of social work in Jerusalem. On January 1, 1968, Hilde retired and began working as a volunteer for several innovative projects. In 1969, along with Fanny Ollendorf, she developed the idea and practice of personal care for lonely elderly people in several neighbourhoods in Jerusalem. Between 1969 and 1974 she established ‘Matav’ – a company for professional caregivers for the elderly. In 1970 she developed a unique treatment for young people who were neither studying nor in work, and conducted a comprehensive study about the causes and needs of that group. On 23 October 1977 she received the President's Award for volunteering. In 1978 she developed the Association of Services for the Elderly, which also won her an award. In March 1978 she established a programme training retirees to become tour guides. And in May 1980 she continued involving seniors and young people in the community. "]},"created":"1548632712","changed":"1548678521"},"2985":{"title":"Pinkhof, Sophie ","fields":{"field_biography":["Sophie (Shifra) Pinkhof was born on 11.5.1900 in Holland and died in 1987 in Israel. Her mother was Adeline de Beer and her father was Menachem Herman Pinkhof, a doctor murdered by the Nazis in 1943. Sophie had seven siblings. She trained in Amsterdam to become a high school educator and taught mainly Judaism and Hebrew to children and adults and also engaged in educational and youth-oriented work in Amsterdam. She started as an assistant in Beit Israel, a Jewish welfare organization and soon rose to become the vice president of the organization. She then immigrated to Palestine in 1935 and began working in a girls' home of the Mizrachi Women’s Organization as a secretary. Later, she worked as a social worker and, in 1962, she published a paper in the Saad Journal, Israel’s journal of social work, about the institutional placement of children and its negative outcomes. Later in her life, during the 1980s, she wrote short stories and translated books from Dutch to Hebrew. "]},"created":"1548678653","changed":"1548678653"},"3019":{"title":"Preuss-Porat, Bella (born Hamburger)","fields":{"field_biography":["Bella Preuss-Porat (née Hamburger) was born around 1900 in Hamburg, Germany and died in Israel (year unknown). Bella immigrated to Palestine in 1921 with the Blau- Weiß youth movement, first living in Jerusalem and later in Tel Aviv. She studied at the Siddy Wronsky School of Social Work. Following graduation, Bella worked with Jewish immigrants and refugees in the immigration department of the Jewish Agency in Tel Aviv between 1933-1940. During that time, in correspondence with Dr. Giora Lotan, she complained to the Jewish Agency about the lack of resources and low salaries for social workers. She also became involved in political struggles between the department of social work in Tel Aviv and the Jewish Agency. Bella was a member of the Achduth Haavoda-Poaley Zion movement. Her first husband was Dr. Walter Preuss, a Jewish-German economist and social worker, and the couple had one child. Her second husband was Prof Grushke. "]},"created":"1549322977","changed":"1549374037"},"3048":{"title":"Roos, Leah ","fields":{"field_biography":["Leah Roos was born on 5.6.1910 in Germany and died in Israel (year unknown). After receiving training as a nurse, she attended the Soziale Frauenschule in Frankfurt am Main, where her major field of study was health welfare work. After graduating in 1932, she worked as a volunteer at Frankfurt’s municipal welfare bureau. In that same year, Leah was a candidate for the Department of Social Work in Jerusalem. In 1935, she was sent by Zipora Bloch from Jerusalem’s Department of Welfare to work as a social worker in Tiberias, after which Leah wrote a detailed report in Hebrew about her extensive work there. There is evidence that she planned to establish a provident loan fund for people in need. It is also possible that she was the donor of the Chana-Lea Roos immigrant living quarters and kindergarten at Bney Zion Israel in 1956. "]},"created":"1549406952","changed":"1549460551"},"3074":{"title":"Rosenstein, Mirjam (born Rosenblum, married names Warszawski, Wolff)","fields":{"field_biography":["Mirjam Rosenblum (married names Warszawski, Wolff, Rosenstein) was born on 3.3.1911 in Berlin. Her mother was Gertrud Rosenthal (married name Rosenblum, née Vogelsdorff), who was a director of a business. Gertrud was deported to Riga, and died on 9.5.1945. Gertrud's second husband was Erich Rosenthal, who was deported together with her. Mirjam's father was Hermann Rosenblum, and her siblings were Alexander Rosenblum, Eva Thea (Chava) Perls. All three children went to high school. Mirjam attended a Realschule in Berlin and left it in 1928. From 1928 to 1929 she attended commercial school also in Berlin. Afterwards, she worked as a typist until 1931. Later, she trained in social work at the Soziale Frauenschule, 1931–33. She was unemployed for two years and volunteered at Choluz in that time, before working as a social worker from 1935–1938 at the Jewish community employment agency. Mirjam emigrated first to the Netherlands in November 1938, then in summer 1939 to Palestine, to Kibbutz Giwath Brenner. In 1944 she married Michael Wolff, with whom she moved to Ben Schemen, where she lived until 1954. Michael worked there and died in 1954.They had a daughter. After her husband's death, Mirjam moved to Jerusalem, and during the 1950s worked as a social worker with families. In 1990 she moved to Haifa. In 1958, she married Helmut Zwi Rosenstein (born in 1911, a piano teacher). "]},"created":"1549735344","changed":"1550253324"},"3094":{"title":"Rosenthal, Ruth (born Hirsch)","fields":{"field_biography":["Ruth Rosenthal (née Hirsch) was born on 18.2.1910 in Golub, near Thorn, then in Germany, and died in Israel (year unknown). Her father was Eduard Hirsch and her mother was Meta (née Neisser). Between 1927 and 1929, Ruth did her training as a kindergarten carer at the ‘Sozialpädagogische Seminar’ of the ‘Verein Jugendheim’, before working as a kindergarten carer for the JFB in Breslau from 1929–1930 and later on for other Jewish organizations. She immigrated in October 1933 to Palestine, lived in several Kibbutzim until 1935 and married Moshe Max Rosenthal in 1947. The first few years, she did agricultural work. At the end of the '30s, she was able to work as kindergarten teacher, but was paid as an unskilled worker because of language problems. From 1953 she ran a bookstore in Kiryat Ono. "]},"created":"1550253417","changed":"1550440263"},"3145":{"title":"Schlesinger, Dr. Bella (née Olkanizki)","fields":{"field_biography":["Bella Schlesinger (née Olkanizki) was born on 18.5.1898 in Vilnius and died in 1977 in Tel Aviv. She was married to Dr Yaakov Schlesinger, and had a sister, Nyuta Arzichovski, who probably lived in Israel as well. Between 1918 and 1919 she studied Law at the University of Char'kov, and between 1919 and 1921 she studied at the Seminar for Wohlfahrtspflege in Munich, between 1920 and 1923 in Berlin, and between 1923 and 1925 in Jena (Economics). She graduated with the title Dr. rer. pol. Between 4 May 1926 and 31 October 1935, Bella worked at the Zentralwohlfahrtsstelle der Deutschen Juden (Central Welfare Bureau for Jews in Germany, ZWST) with Dr Giora Lotan (Georg Lubinski), Dr Friedrich Ollendorff, and Rabbi Dr Leo Baeck. She was highly active in the Jüdische Wohlfahrtspflege und Sozialpolitik Journal. In Berlin, she lived at Opitzstrasse 2, and in 1933 she moved in with Anni Samuelsdorff. In 1935 she emigrated to Palestine, initially working as a secretary for WIZO in Jerusalem. In 1940 she founded the Tel Aviv Social Work School. During the 1940s she also worked as a central social worker in the Tel Aviv social work department. In 1949 she was awarded a UN scholarship for a course in Switzerland. "]},"created":"1550787862","changed":"1575562331"},"3167":{"title":"Schreiber, Lina","fields":{"field_biography":["Lina Schreiber (née Korn, later Hurwitz) was born on 7.9.1907 in Rozwadow, Poland and died on 27.6.1974 in Haifa. Her family emigrated in 1907 to Hannover and later moved to Berlin. Between 1924 and 1930 Lina worked as kindergarten carer, and between 1930 and 1931 she trained as a children's nurse. Between 1931 and 1932 she studied at the school for social work in Berlin and between 1933 and 1938 she worked for the Jewish community in Berlin (Jewish welfare and youth welfare office). She also worked with Hilde Hochwald at the Zentralwohlfahrtsstelle der Juden (Central Welfare Bureau for Jews in Germany, ZWST) in Berlin. The family emigrated to Palestine in December 1938, and Lina worked again with Hilde Hochwald, this time in the Haifa welfare department. Lina was married in Berlin to Israel Schreiber, who died in Haifa on 6.1.1963, and they had one son, born in 1943 in Haifa. "]},"created":"1550876850","changed":"1550938160"},"3180":{"title":"Shapiro, Ellen (born Oppenheim)","fields":{"field_biography":["Ellen Shapiro (née Oppenheim) was born on 15 or 19.1.1915 in Erfurt, Germany and died on 31.10.1998 in Ein Shemer, Israel. Her parents were Herman and Johannah (Baden) Oppenheim, a religious Zionist family. Ellen grew up in Berlin-Grunewald. She studied at the Sozialpädagogische Seminar of the Verein Jugendheim between 1932 and 1933 (Kindergärtnerinnen-Hortnerinnenseminar). She immigrated to Palestine at the end of 1934, and was married to Benek Shapiro. They had three children. Ellen worked at the ‘workers' farm’ (Meshek Poalot) in Petah Tikva. She later worked as a kindergarten teacher and elementary school teacher, and in special needs education. "]},"created":"1550938240","changed":"1550939987"},"3189":{"title":"Stern, Ilse ","fields":{"field_biography":["Ilse Nannette Stern was born on 22.2.1916 in Karlsruhe, Germany and died in Israel (year unknown). Ilse was the daughter of Auguste and Hermann Stern, who was a merchant. Ilse wanted to study medicine but was unable to finish school due to anti-Semitic discrimination. Instead, she completed a course as a nurse in Karlsruhe at the private clinic of a Jewish physician, Dr. Paul Hirsch. The Guggenheim family from Berlin hired her to serve as a baby nurse in Palestine for their daughter’s newborn child, and Ilse worked for the family in Palestine from November 1936 through April 1937. After her return to Germany, she attended a seminar in 1938 in Frankfurt to train as a household management teacher and manager. She was then employed as a nurse and as the assistant to the manager in the nursing home of the Frankfurt Jewish community. She quickly resigned from this position because of internal political problems. She immigrated to Palestine via Italy, reaching Palestine on September 22, 1938. After her arrival in Palestine, she worked for approximately eight months as an intern at the Agricultural School in Nahalal. She subsequently held a variety of positions as a diet cook, a maid and a nurse. She served with the British military for four and a half years from 1942. Following this service, she worked very briefly with U.N.R.R.A. and as a house mother at a home for dismissed female soldiers. She also worked as a social worker in Cyprus with the Jewish Joint Distribution Society and worked with the Preparatory Commission for International Refugees Organization. At the Jewish Agency, where she worked between 1948 and 1952, she served as a main supervisor for new immigrants in the Department of Immigration Absorption. Because Ilse had a particular interest in medical fields such as psychiatry, psychology, hygiene, public health, she decided to continue her education. From 1952 through 1953 she attended the Paul Baerwald School of Social Work in Versaille, France. At the end of 1953, she was hired as a lecturer by the Tel Aviv municipal School of Social Work. She continued her education, studying at the School of Applied Social Sciences of Case Western Reserve University in Cleveland from 1955 through 1957. She also attended a summer course in the field of social work in 1956 at Smith College in Massachusetts. In March 1957 she returned to Israel and continued her work at the School of Social Work, which was taken over by the Hebrew University of Jerusalem in 1958. In order to continue working there, she now had to earn a doctorate. She apparently sought to do a doctorate in Cleveland, although it is not clear whether she was indeed awarded one. During the 1970s, Ilse headed the governmental demography center. "]},"created":"1550940175","changed":"1551290498"},"3232":{"title":"Sternberg, Elsa (born Else Rosenblüth)","fields":{"field_biography":["Elsa Belah Sternberg (née Else Rosenblüth) was born in 1899 in Messingwerk\/Eberswalde Germany and died in Kfar Saba Israel (year unknown, after 1991). She was born into a Jewish-orthodox family. Her parents were Fanny and Samuel Rosenblüth, who had a leading position at the Hirsch-Company in Messingwerk\/Eberswalde. Elsa was the youngest sister of Felix Rosenblüth (later Pinchas Rosen), who was a leading German Zionist and a founder of the Blau-Weiß youth movement in 1911. In 1910, the family moved to Berlin. Elsa became attracted to Zionism in an early age. In Berlin, she was trained as a kindergarten teacher at the Pestalozzi-Fröbel-Haus in Berlin-Schöneberg. She also studied special education and nursery care. Between 1917 and 1920, Elsa volunteered at the Jüdisches Volksheim, the Jewish settlement founded by Siegfried Lehmann in Berlin-Scheunenviertel. She founded an association which supported Lehmann’s work in Kovno and later in the Ben Shemen Youth Village. Elsa immigrated to Palestine together with her husband in 1933. At first, she worked in her husband’s business. Later, she received further training in psychology and worked as an educational counsellor. Elsa was a member of the Independent Liberal Party. "]},"created":"1551290694","changed":"1551648697"},"3247":{"title":"Stern-Horowitz, Etschi (born Stern)","fields":{"field_biography":["Etschi (Ätschi) Stern-Horowitz (née Stern) came from Vienna (dates of birth and death are unknown). She married the well-known Jewish writer Yacoov Horowitz in 1941. She worked at the Department of Social Work in Tel Aviv in the late 1930s and 1940s. Etschi also worked in the Strauss Center, where psychological tests for children and youth were conducted. In the late 1950s, she studied in Sweden. "]},"created":"1551648775","changed":"1551649799"},"3253":{"title":"Straus, Rahel (born Goitein)","fields":{"field_biography":["Rahel (Rachel) Straus (née Goitein) was born on 21.3.1880 in Karlsruhe, Germany and died on 15.5.1963 in Jerusalem. She was the daughter of Henriette Ida Goitein, an elementary school teacher, who headed an orphanage in Bad Ems in 1901, and of the orthodox Rabbi Gabor Gedalya Goitein. Rahel attended a girl’s secondary school until 1893, after which she studied in the first German grammar school for girls in Karlsruhe, from which she graduated in 1899. Despite the negative attitude of some professors, she enrolled as the first female medical student at the University of Heidelberg, after having audited lectures in Old French and English. She became one of the first four female students to have fully matriculated at the University of Heidelberg. From 1901 on, she was active in the Association of Studying Women in Heidelberg. In 1905, she married Elias (Eli) Straus, a lawyer from Karlsruhe. She earned her doctorate in the year 1907, writing her dissertation on choriocarcinoma. She travelled to Palestine with her husband in 1907, after which they returned to Munich, where they had five children. Even with her family obligations, Rahel Straus did not abandon her career, but completed her medical internship and residency. In 1908, she opened a gynecological practice in Munich, becoming the first female doctor to have been trained at a German university. As a doctor, Rahel Straus fought for the abolition of §218 which criminalized the termination of pregnancy, was involved in social and educational issues, chaired the Association of Jewish Women for Palestine and was a member of the Women's International Zionist Organization (WIZO). In 1918, she participated in some committees of the Munich Soviet Republic. In 1932, at the request of Bertha Pappenheim, she took on a leading role in the Jüdischer Frauenbund (JFB), the Jewish Women’s League, which, among other activities, helped mothers with illegitimate children and victims of women’s trafficking. Her husband Eli died of cancer in 1933, and in the same year, Rahel Straus immigrated to Palestine with two school-aged children. There they experienced a difficult period of adjustment in the beginning. Rahel Straus continued to work as a doctor, although she was less active than she had been in Germany, as there was a large influx of doctors to Palestine at that time. Most of her efforts were devoted social activism revolving around social work. She was a member of the Brit Shalom movement, founded an employment office for housekeepers for WIZO, and organized cooking classes and the public kitchen for Hadassah between 1936 and 1940. She also established, together with the Jerusalem community committee a center for collecting used clothing and furniture and making it available to the needy called Beged Zol, or inexpensive clothing. Additionally, together with Malka and Dr. Abraham Spiegel, she co-founded AKIM, Israel’s National Organization for People with Intellectual Disabilities where she established a weaving workshop. Rahel headed the Golden Age Union for the elderly in Jerusalem and in 1952, founded the Israeli branch of the Women's International League for Peace and Freedom, of which she remained the honorary president until her death in 1963. The AKIM organization named its educational center after her. "]},"created":"1551650222","changed":"1552257394"},"3254":{"title":"Strauss-Weigert, Dr Dora (born Weigert)","fields":{"field_biography":["Dora Strauss-Weigert (née Weigert) was born in 1890 in Hamburg and died in 1954 in Israel. She wrote her dissertation about the Jewish people of Hamburg in around 1919. She was especially interested in social work with working women. After the death of Fritz Mordechai Kauffmann in 1921, she and Salomon Adler-Rudel headed the Jewish workers' welfare bureau in Berlin (Auguststr.), where she was succeeded by Regina Schächter in 1922. In 1934, she immigrated to Palestine. There, Dora worked at the youth aliyah between 1936 and 1948, and was especially engaged in psychological work with juvenile immigrants. "]},"created":"1551736307","changed":"1552341817"},"3280":{"title":"Szwedron, Genia ","fields":{"field_biography":["Genia Szwedron (Jenya Schwederon) was born on 20.8.1905 in Poland and died on 4.7.1996 in Jerusalem. She managed a group (named ‘Chulda’) in the children's home in Blankenese which was run by the Joint Distribution Committee. She studied and worked with Janusz Korczak, and later in Israel became a social worker helping families in Haifa. Between 1946 and 1947, she travelled to Germany with the Jewish Agency and headed the Warburg children's home for Holocaust survivors in Blankenese, near Hamburg. In 1960 she became an official welfare officer for adoption law. "]},"created":"1552258565","changed":"1552429278"},"3300":{"title":"Tanne, Clara (born Horwitz)","fields":{"field_biography":["Clara Tanne (née Horwitz) was born on 1.3.1897 in Berlin and died in 1997 in Raanana, Israel. She studied at the social women's school, senior class in 1916\/17, in 1926 at the Verein Jugendheim in Berlin-Charlottenburg, and in 1927 on a training course for health care in Munich (Israeli private home for the sick). She also headed a Jewish Heilpädagogik (remedial education) home for children in Bad Duerrheim as of 1925 (together with Bettina Falk). She emigrated in 1939 to Palestine. Clara was married to Shmuel Tanne, who established a farm in Raanana after their immigration, and they had 4 children. Clara worked and lived in Raanana, helped on the family farm and was a nurse, a mid-wife and a social worker. She also took part in the community synagogue of German Jews in Raanana. In 1994 she received an honorary prize from Raanana city council. "]},"created":"1552429385","changed":"1553888063"},"3324":{"title":"Tchernovitz-Avidar, Yemima (born Tchernovitz)","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-GB\"><span><span><span>Yemima Tchernovitz-Avidar (née Tchernovitz) was born on 8. or 26.10.1909 in Vilnius and died on 20.4.1998 in Jerusalem. She was a famous author of children's literature in Israel, and her works are considered classics. In her childhood, Hebrew was spoken at home and the Jewish culture was very important. At the age of 12, she arrived in Palestine together with her family. When she was just 14, her first work was published: a short story in the New York children's newspaper ‘Eden’. In 1930, she went to Germany to study social work and later pedagogy with Charlotte Bühler in Berlin and Alfred Adler and Anna Freud in Vienna. There, she met her husband Yosef Rochel (1906–1995). After her return to Tel Aviv, she worked as an educator and director of a kindergarten until 1945. During her time as a kindergarten teacher, she wrote her first children's books. In 1953 she moved with her family to Jerusalem. In 1985, the Institute for Children's Literature at Beit Berl college was named Merkaz Yemima after her. <\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1554632409","changed":"1554639268"},"3339":{"title":"Thon, Hannah Helena (born (Cohn)","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-GB\"><span><span><span>Hannah Helena Thon (née Cohn) was born on 22.1.1886 in Dresden, Germany and died on 10.4.1954 in Jerusalem. Hannah was raised in a Christian environment and turned to Judaism during a stay in London in 1907. After school, she took a job as a secretary in Berlin and attended lectures in social sciences in her free time. She became a journalist and Zionist. In 1913 she was invited to Palestine by Arthur Ruppin to run the secretariat of the Palestine Office in Jaffa, but had to return to Germany because of World War I. Hannah worked with Martin Buber and Victor Jacobson, editing various journals such as 'Der Jude'. She was involved in the founding of the Women’s International Zionist Organization (WIZO) in London shortly after WWI. On a subsequent visit to Palestine in 1921 she married Dr Ya’akov Thon (1880–1950), who was among the founders and leaders of several Jewish national institutions in pre-state Israel. In Palestine, Hannah was a leader of the Histadrut Nashim Ivriot (Hebrew Women’s Organization, HWO, merged with WIZO in 1933), editor of Ha-Ishah (‘The Women’), the first feminist journal in Palestine, and was involved in settlement work in the poor Jewish neighbourhoods of old and new Jerusalem. Additionally, she taught the course \"Sociology of Oriental Jews\" at Siddy Wronsky's school for social service in Jerusalem and was involved in research in the field of cultural and ethnic diversity. In 1947, she began conducting surveys on Sephardic Jews from the Balkans, North Africa, Yemen and Asia, with 300 families. Hannah was also active in the Organization of German Immigrants and the political party known as Aliyah Hadashah – the Association of Central European Immigrants.<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1554639404","changed":"1593692124"},"3340":{"title":"Turnowsky-Pinner, Margarete (born Pinner)","fields":{"field_biography":["<h2><span><span><span><span lang=\"EN-GB\"><span><span><span>Dr Margarete (Grete) Turnowsky-Pinner (née Pinner) was born on 27.2.1884 in Kościan (Poland) and died in January 1982 in Tel Aviv. Before World War I, her family moved to Berlin , where she studied at a teachers' seminary, and later on a sociology course, and graduated with a PhD. Margarete worked at the Jewish employment exchange and published papers in several journals, as the ‘Jüdische Rundschau’ and some periodicals of Jewish welfare agencies. She was engaged at the Jewish Settlement ‘Jüdisches Volksheim’ run by Siegfried Lehmann in Berlin and worked with Jewish immigrants from Eastern Europe. Margarete was married to Walter Turnowsky, a graphic designer who founded the well-known Turnowsky design company in Israel. During her first stay in Palestine, she worked in Jerusalem as a pedagogue between 1925 and 1927. From 1930 to 1933, she held a leading position for the Scholarship and Welfare Fund of the Schocken department store, founded by Salman Schocken. Margarete immigrated finally to Palestine in 1933, after her divorce, and settled in Tel Aviv. There, she began to work with German-Jewish immigrants. Additionally, she published sociological essays and studies concerning social work in the Yishuv.<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/h2> "]},"created":"1555273345","changed":"1556480738"},"3371":{"title":"Twersky, Jenya (born Ginzburg)","fields":{"field_biography":["<p>Jenya Twersky (Rahel, née Ginzburg) was born on 16.8.1904 in Baranowitz, the Russian Empire, and died on 6.4.1964 in Haifa. First, she studied statutory law at the University of Warsaw. In the spring of 1923, she emigrated to Palestine. Between 1929 and 1931, she went back to Germany to study social work at the ‘Sozialpädagogisches Seminar’ (Social pedagogical seminary) of the Verein Jugendheim in Berlin-Charlottenburg. After her return, between 1932 and 1942, she headed the department of social work in Haifa, and between 1942 and 1948 she headed the department of social work in Jerusalem. Jenya was a central figure in the Histadrut (official workers' union) and Moetzet ha-Poalot (women workers' union). She was also a member of the Mapai Party (the labour workers' party in Israel) and later became a member of the Israeli Knesset parliament and initiated social legislation for the poor and the elderly.<\/p> "]},"created":"1556480747","changed":"1557431393"},"3382":{"title":"Unger, Eva (born Warburg)","fields":{"field_biography":["<h2><span><span><span><span lang=\"EN-US\"><span><span><span>Eva Unger (née Warburg) was born on 31.12.1912 in Hamburg and died on 24.11.2016 in Rehovot in Israel. She was a member of the well-known Warburg family, and Anna and Fritz Warburg were her parents. She trained to be a kindergarten teacher, and following her graduation in 1933, she worked in that field until her dismissal from her position because she was Jewish. She immediately founded her own, Zionist-oriented children's home in Hamburg. After the Kristallnacht pogrom in 1938, she immigrated to Sweden, taking with her all the children entrusted to her and placing them with Jewish families. In Sweden, she worked for the Association of German Jews and, at the request of Henrietta Szold, took on the responsibility for the Youth Aliyah organization in Sweden. Consequently, she succeeded to help transport about 450-500 Jewish children to Sweden. Meanwhile, she founded Kibbutz Hälsinggården in Dalecarlien, Sweden, and another children’s home in Norrkoeping, Sweden. In 1946, she immigrated to Palestine and married Naftali Unger. They first lived in Givat Brenner, where they had two children (born in 1948 and in 1950). In 1950, Eva and Naftali joined the new Kibbutz Netzer Sereni, where Eva worked with traumatized children until moving to Rehovot with her husband in 1969. Even after World War II, Eva continued her efforts to save Jewish children and get them to Palestine, including a group of over1.000 children interned in Cyprus. In addition, Eva engaged in employment counselling and worked for the Youth Aliyah organization. Later in life, she ran arts and crafts classes and a library for the neighborhood in which she lived. <\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/h2> "]},"created":"1557432910","changed":"1557951695"},"3417":{"title":"Wagner-Tauber, Lina (née Tauber)","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-US\"><span><span><span>Rachel Lina Wagner-Tauber (née Tauber) was born on 3.7.1872 in Tukum in Lithuania to Eitel and Wolf Tauber and died on 12.12.1935 in Tel Aviv. Her sister was Frieda Ryfka Schumacher. In 1903, Lina married Jacob H. Wagner (1860-1925), a well-known member of the Jewish community in Nachot, Austria. Jacob owned a library of about 18.000 volumes of Judaica and Hebraica, which was ultimately contributed to the <em>Neue Synagoge<\/em>, the New Synagogue in Berlin. Rachel and Jacob had two sons, Zwi and Moses\/Mosche Wagner. When women were given the right to vote and stand for election in Germany, she and Bertha Falkenberg (1876–1946) were the first women to become members of Berlin’s assembly of representatives. Wagner-Tauber co-founded the first Zionist women's organization in Germany, the Jewish-National Women's Union. In addition, she was involved with the <em>Ahawa<\/em> orphanage in Berlin and established soup kitchens for Jews from Eastern Europe. After her immigration to Palestine in 1932, she worked as a social worker and author, publishing in the German-Jewish journal <em>Jüdische Rundschau<\/em> and in other outlets. Rachel was one of the founders and a board member of the <em>Ichud<\/em> Association of central European Jews, where she also led the public welfare department. She wrote and published the books <em>Jüdische Spiele<\/em>, or <em>Jewish Games<\/em>, <em>Jüdische Märchen<\/em>, or <em>Jewish Fairytales<\/em> and <em>Sagen dem Midrasch nacherzählt,<\/em> or <em>Legends: Retelling the Midrash<\/em>.<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1558990206","changed":"1576575980"},"3432":{"title":"Jonas, Benjamin ","fields":{"field_biography":["<p><span><span><span><span><span>Benjamin was born in Fürth (Germany) on April 15th 1909 and died on June 19th 1985 in Nahariya (Israel). He was one of the founders of residential care in Israel. His parents were Rosa and David Jonas, and he had two older brothers and a sister. His parents sold kosher meat and dairy products. He attended Jewish schools in Fürth, played the violin and football. He studied at the teacher training college in Cologne and graduated from the University of Würzburg as a special educator. Benjamin was active in the Ezra movement, his group leader was Professor Jeschajahu Leibowitz. Then, he decided to immigrate to Palestine. In the spring of 1933 he suffered an anti-Semitic attack and crossed the border to Holland on the same day. There he worked in a boarding school for disabled children, preparing for immigration to Palestine. In 1934 he reached the port of Jaffa. In the country, he initially accepted various manual work. He improved his Hebrew and arranged the immigration of his sister and father. In 1934, Benjamin married the nurse Ruth Binth, with whom he had been friends since his time in Cologne. One and a half years after his immigration, he decided to return to work in his own profession as a special education teacher. He worked in the children's village Me'ir Schefeija with Dr. Fürst, first in the bakery, before finally teaching after one year.<\/span><\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span><span>In 1942, Benjamin Jonas became the director of Keitana, a children's home in Carmel, founded in 1940 by WIZO. There he worked with Rachel Kagan, the director of the WIZO World Organization. He directed the home for 30 years, until 1972. While it initially cared for the children of the waves of immigration, it later changed to a facility for adaptable children. It still exists.<\/span><\/span><\/span><\/span><\/span><\/p> <p><span><span><span><span><span>In 1973 Benjamin Jonas retired and settled in Nahariya. He wrote a book about his experiences with pedagogical institutes. Together with Prof. Kohen-Raz, he made inquiries into graduates of the Kinderhof and published the research results in German and Israeli journals. He also founded \"Big Brother\" in Haifa, where volunteers are trained to assist children who lack an adult caregiver. In 1983, Benjamin was awarded the Hasuni Prize for his life's work by the Ministry of Social Affairs.<\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1560606833","changed":"1601551756"},"3458":{"title":"Zirker, Dora ","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-US\"><span><span><span>Dora Zirker was born in 1905 in Germany. The time and place of her death are unknown. Between 1934 and 1939, Dora worked as a secretary and as a social worker at a center for Jewish social work, she also worked at a job center before immigrating to Palestine in 1939. In 1939, she worked for a few months in Kibbutz Givat Brenner. Later, she worked for a newspaper in Tel Aviv and did housework in Jerusalem. In 1942, she was recruited to the British Army, and where she worked as a stenographer and a typist. She was a candidate at the Siddy Wronsky's school for social service in Jerusalem in 1945, but it is unknown if she studied there eventually.<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1572184913","changed":"1572277925"},"3471":{"title":"Ziemles, Mirjam (born Nachmanzon)","fields":{"field_biography":["<p><span lang=\"EN-US\"><span><span><span>Mirjam Ziemles was born in 1885 in Poland, where she was raised in Gdansk, and died in 1962 in Haifa. She was the daughter of Rabbi Yekuthiel Nachmanzon and married Yoel-Wollf Ziemles. Mirjam studied Heilpädagogik (special education) in Vienna and worked in Viennese youth courts with children with behavioral and educational problems. She immigrated to Palestine in 1924 and worked with new immigrants for many years through WIZO. <\/span><\/span><\/span><\/span><\/p> "]},"created":"1572940873","changed":"1572942679"},"3488":{"title":"Ish-Tov Livnat, Jehudith (née Hertha Löwenthal)","fields":{"field_biography":["<p><span>Jehudith (Hertha) Loewenthal Ish-Tov Livnat was born on 24.11.1904 in Heidelberg bei Schildberg and died in Israel (year unknown). She was trained for social work at the Soziale Frauenschule, Berlin; full course October 1927\/29, then women's academy. She worked in Germany in Jewish child welfare and Jewish health care, and specialized in treating families at the municipal social services. She also worked in a variety of areas: families, children and youth, health, employment and immigrants, mostly at the Berlin Jewish community. She immigrated in 1935 to Palestine (her address from 1968 was Zichron-Yaacov-Str. 8, Tel Aviv). After her emigration to Palestine she was trained at the social bureau in Jerusalem, and was sent by Henrietta Szold to Tiberius, where she headed the social work office between the 1936-1942. Many difficulties accrued at the beginning of her work, as she opposed the spirit of traditional charity, had trouble understanding the local people, and lacked the patience for slow and gradual processes. Thanks to the supervision and support of Zipporah Bloch and Henrietta Szold, she was able to interact with the local population and to raise funds for the Bureau. In addition, she established a child nutrition center and promoted preventive work in schools, by raising awareness to the needs of students with cognitive difficulties. She supported the establishment of special education institutions and, if necessary, directed children with acute difficulties to out of home institutions. Later on, she was appointed as a probation officer by the mandate government and operated to treat soldiers' families, and worked under the guidance of Regina Schechter in monitoring home placement for children. In 1946, she took part at the delegations to DP camps in Germany and stayed there for two years. After the establishment of Israel she worked for 21 years as a nationwide supervisor in the child care department, this time again under the guidance of Zipporah Bloch, and established an orderly inspection on day care and fosters families. Moreover, she struggled to promote the needs of mothers, supported day care centers, and promoted work search for women in an orderly and respectful manner, including various training courses. She also took part in an international internship program within the framework of the UN, a seminar of UNICEF and conferences in various countries in the field of child and youth care. After her retirement, she continued to work in the center of the demography in the prime minister's office and volunteered as chair of the pensioners association of the workers' union. In 1979 she won the Labor (Avoda) prize, and in1986 she won the Ora Namir prize for social contribution.<\/span><\/p> "]},"created":"1574602013","changed":"1574691927"},"3566":{"title":"Weihl, Elisheva (née Elisabeth Frank)","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-US\"><span><span><span>Elisabeth Elisheva Weihl (née Frank) was born on 3.8.1895 in Germany and died on 24.2.1982 in Israel. She was the daughter of Max Frank. Elisabeth studied social work in Stuttgart prior to 1932 but did not work in the field after her training. Instead, she immigrated to Palestine around 1935, where she worked in a kindergarten in Jerusalem and learned Hebrew. In 1937 she married Dr. Eliezer Ernst Weihl and they lived in Nahariya. There, both Elisabeth and Ernst established a social aid committee. During 1937 and 1938, Elisabeth did social work for a social aid committee and, with the help of Siddy Wronsky, planned to train women to undertake social work. <\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1575721402","changed":"1575725633"},"3585":{"title":"Rosolio, Pnina Ezeria (née Wiener, Paula)","fields":{"field_biography":["<p><span lang=\"EN-US\"><span><span><span>Pnina Ezeria Rosolio (née Paula Wiener) was born in 1909 in Katowice, Poland and died in 1995 in Israel. Her mother owned a bookstore. Pnina went to Palestine for the first time when she was sixteen, where she worked in a Jewish-Arab kindergarten and learned Hebrew. After two years, she returned to Germany, because she wanted to receive formal teacher training. She attended the <em>Pestalozzi-Fröbel-Haus<\/em> in Berlin-Schöneberg, where she was trained as a kindergarten teacher. Between 1932 and 1933, she worked in the Jewish orphanage <em>Ahawah<\/em>. Pnina immigrated to Palestine in 1933. She married in Palestine and became acquainted with Chaim Guri. In 1974, she published a children’s book <em>Hayalkut<\/em> (<em>The School Bag<\/em>). She also wrote articles about child education.<\/span><\/span><\/span><\/span><\/p> "]},"created":"1575726705","changed":"1576064554"},"3618":{"title":"Lichtenstein, Paula Ruth","fields":{"field_biography":["<p><span>Paula Ruth Lichtenstein was born on 21.7.1908 in Guben and died on 21.9.1979 in Israel. Her father was Samuel Lichtenstein, a municipal judge. The family moved to Berlin shortly before WW I broke out. She attended the Margarethen-Lyceum in Berlin and afterwards a women's school. Between 1927-1929 she was trained as Hortnerin at the Sozialpädagogische Seminar of the Verein Jugendheim Anna von Gircke, and worked as a social worker for the Jewish welfare and youth welfare office in Berlin (different recreation homes for children, i.e. Land-Erholungsheim of the city of Berlin, Scheuen\/Celle in 1930, 'Berliner Jugendland' Zossen 1929-1930, Weißensee, Miersdorf). Then did her training for social work at the Soziale Frauenschule, Berlin, full course Easter 1931\/33, but could not achieve the state accreditation. During her studies there she worked at legal aid for workers in Berlin. On 13.4.1933 she immigrated to Palestine. In 1933 she was one year in Kibbutz Beth Zerah and afterwards in Herzlia, both times in agricultural work. In September-October she worked as a practitioners with Mirjam Hoffert in treating German Jews immigrants. Around 1936-1937 she had to pass an internship in social work, before she was allowed to work as an official social worker since 1939. Firstly she worked at the municipality of Ramat Gan, and from 1942 onwards in Tel Aviv (half time at Jewish Soldiers Welfare Committee, 41 Lilienblum St., and half time at welfare bureau Givataim). From 1951 she worked at the government of Israel, and during the 1960's was a national supervisor in the field of youth and child care at the ministry of welfare. In 1957 lived in Kfar Saba.<\/span><\/p> "]},"created":"1576065443","changed":"1576419208"},"3654":{"title":"Bolag, Alisa (Elisa)","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-GB\"><span><span><span>Alisa\/Elisa Bolag was born in Basel, Switzerland (year unknown) and died in Israel (year unknown). She worked in immigration welfare for the Zionist organization in Basel as a member of WIZO. She immigrated to Palestine in 1935. At first, she spent one year working in settlement houses (doing club and kindergarten work) in the Nachalat Achim quarter in Jerusalem, with Oriental Jewish communities. Later she studied at Siddy Wronsky's School for Social Service in Jerusalem, graduating with honours in 1939 and writing her final project on settlement houses and their importance to Israeli land. Later, she did her practical training in all branches of social work in Jerusalem, Tiberias and Galilee. As of 1939 she became a social worker in Afulah and surroundings, where she organized a new social welfare bureau. In 1947 she worked at the social welfare office in Nathanya.<\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1576422807","changed":"1576426749"},"3674":{"title":"Neter, Mia (Minka) (née Thalmann)","fields":{"field_biography":["<p><span><span><span><span lang=\"EN-US\"><span><span><span>Mia (Minka) Neter (née Thalmann) was born in 1893 in Tauber-Bischoffsheim, Germany and died in 1975 in Tel Aviv. She was one of four children of Emilie and Gumpert Thalmann, who was a teacher. Following her studies, she served as the head of a Jewish kindergarten and day care institution in Mannheim between 1912 and 1915. She then worked for the Mannheim municipality as a social worker for juveniles between 1915 and 1926. She was active in the Zionist movement and founded the agricultural training centers in Birkenau and Leutershausen. After completing a course in social work at the Fröbel-Seminary in Mannheim, she directed the <em>Jugend und Wohlfahrtsamt<\/em>, or Youth and Welfare Office, of the Jewish community in Mannheim from 1926 through 1939 and published pieces in the local Jewish community bulletin. Mia married Richard Neter, in 1927, who was born in 1881 in Gernsbach, Germany and owned a metal factory. He died in 1953 in Israel. In 1939, she and her husband immigrated to Palestine. Between 1939 and 1947, she worked as a social worker and supervisor of family social work in Tel Aviv, where she implemented new social work methods. Between 1947 and 1965, she was a top supervisor department of welfare in Tel Aviv. Between 1958 and 1969, she founded and voluntarily directed the Matav home care service, an organization for welfare services for the elderly. Mia retired in 1965. In 1966, she won the \"Kaplan\" governmental award for contribution in the welfare sector. <\/span><\/span><\/span><\/span><\/span><\/span><\/span><\/p> "]},"created":"1576426807","changed":"1576428554"},"3793":{"title":"Schupler, Zwi","fields":{"field_biography":["<p><span><span><span>Heinrich Zwi Schupler was born in 1907 in Cologne, Germany and died in 2003 in Haifa, Israel. Heinrich's father, who was an Austrian citizen, immigrated to Germany in 1901 from the city Buczacz on the border of Ukraine\/Galicia. Heinrich finished his studies in a professional commercial school, but decided eventually not to continue in this profession. In 1928, he decided to become a social worker, and began social work studies in Cologne and later in Berlin (school unknown), with an internship in treating youth populations. Heinrich Zwi was an enthusiastic Zionist, and was active to form a branch of the movement in Berlin. In 1933, Heinrich married Sarah Silbermann, with whom he immigrated to Palestine in the year 1935. The couple had a daughter. In Palestine, he initially worked as a social worker for Hitachduth Olej Germania (later Association of Jews from Central Europe). Before 1948, he started working as a welfare coordinator of the human source department in an oil commercial company, where he worked until his retirement.<\/span><\/span><\/span><\/p> <p><span><span><span>Zwi was involved in founding the \"Köln and Rheinland (Cologne and Rhineland) German Jews organization\". He organized cultural and social activities for German immigrants in German language, which were intended to help them to gain a better understanding of the political reality in Palestine.<\/span><\/span><\/span><\/p> <p><span><span><span>In his 60's, he was involved in promoting the new relationship between Israel and Germany, by corresponding with diplomatic figures in Germany and inviting them to visit Israel. <\/span><\/span><\/span><\/p> "]},"created":"1582712573","changed":"1582885830"},"3811":{"title":"Rothschild, Dr. Leopold Jehuda","fields":{"field_biography":["<p><span lang=\"EN-US\"><span><span>Dr. Leopold Jehuda Rothschild was born in 1880 in Waltersbrück, Hessen-Nassau, Germany and died in 1957 in Tel Aviv, Israel.&nbsp; He was the son of Seligmann Pinchas Rothschild and Emma Ernestine Rothschild and the brother of Jochanan Hugo Rothschild, Moses Max Rothschild and Emil Rothschild. Leopold was a Rabbi, teacher and educator. Between 1907-1913 he taught at Jewish schools in Halberstadt and from 1913-1938 he and his wife Ziporah Rothschild headed the Israeli orphan's home Dinslaken, from where he transferred a lot of children to Palestine as of 1935. In 1938, the home was destroyed by the Nazis. Some children went to Antwerp to the son of Leopold, who had a home there. Leopold immigrated to Palestine in 1938, where he did pedagogical work.&nbsp; He was a board member and worked in the Yeshiva \"Kol Hatora\" in Jerusalem, which was established as a German Jews Yeshiva and supported Youth Alyah.<\/span><\/span><\/span><\/p> "]},"created":"1582894397","changed":"1582895832"},"3825":{"title":"Ostfeld, Zvi Hermon (Hermann)","fields":{"field_biography":["<p><span lang=\"EN-US\"><span><span>Zvi Hermon (Hermann) Ostfeld was born in 1912 in Germany and died in 1996 in Israel. He grew up in the city of Humburn (now part of Duisburg). In Germany, Hermon was a social worker and a liberal rabbi in training, a probation officer and a doctorate in the field of penology. After his immigration to Palestine in 1938, he studied at the Training School for Social Service in Jerusalem, from which he graduated in 1941 with a thesis) on social problems with regard to guardianship. In 1942, he moved to Haifa and later became the first Jewish probation officer of the city. After the establishment of the State, he worked in the Ministry of Welfare and was director of the Youth Rehabilitation Department. In September 1952, Zvi Hermon became Prison Commissioner, even when the Israel Prison Service was under the auspices of the Israel Police, from 1952 to 1958. After being appointed Prison Commissioner in Hermon prison, he changed procedures in the Israel Prison Service, which were rooted in the British Mandate period, and involved social workers and educational aspects in the service for the first time. Hermon initiated vacations for prisoners, established a psychiatric department for prisoners suffering from mental illness and a prison Emergency Room in Ramla Prison and canceled the use of cudgel by the prison guards. In 1954, he set a payment for prisoners in exchange for their work. Gradually, the general approach has become a rehabilitative approach. This change of roles led to a fundamental change in the attitude of service to prisoners and in the policy and priorities of the Prison Service. Hermon's therapeutic-rehabilitative approach came to fruition, when the establishment was named after him. In 1958, following a prisoner revolt in the Shata prison, a committee of inquiry headed by Yitzhak Ben Aharon was established. In 1964, he became a board member of the hostel for released prisoners in Netanya. In 1959, he was one of the first members of the faculty of the Institute of Criminology, which was established within the Faculty of Law of the Hebrew University of Jerusalem.<\/span><\/span><\/span><\/p> "]},"created":"1582896741","changed":"1582900441"},"3844":{"title":"Frankenstein, Carl (Karl)","fields":{"field_biography":["<p><span><span><span>Carl (Karl) Frankenstein was born on February 16, 1905 in Berlin and died on January 22nd, 1990 in Israel. He completed his studies in philosophy and psychology at a Berlin University and the University of Erlangen. During his studies, he was actively involved in Jewish relief organizations. After a period in France, he emigrated to Mandate Palestine in 1935. From 1935 to 1965, Frankenstein was a lecturer and faculty member at a number of educational establishments, including the Training School for Social Service in Jerusalem, nursing schools, teaching seminars, Youth Aliyah organizations and the Department of Criminology at the Hebrew University of Jerusalem. In 1937, he was appointed the first juvenile probation officer in Mandatory Palestine. He&nbsp;&nbsp; served as liaison between the Vaad Leumi and the British Mandate authorities in the field of welfare and education and was also active on behalf of the Vaad Leumi with respect to education and welfare of children from Mizrahi families. At the time of the establishment of the State of Israel in 1948\/49, he was appointed head of the Henrietta Szold Institute (National Institute for Research in the Behavioral Sciences) in Jerusalem, which he led until 1953. From 1951 until his retirement in 1969, Frankenstein was a faculty member of the Hebrew University and served as a professor for pedagogy and special education. His principal areas of study were developmental sociology, juvenile delinquency, rehabilitation intelligence, problems in integration of immigrants, ways of thinking, psychology and psychopathy. After retiring from university, he continued with volunteer work, including working as an editor of the journal \"Magamot\". In 1965, Frankenstein was awarded the Israel Prize in education. Frankenstein's research and thoughts were published in many books, primarily in Hebrew, but also in English and German.<\/span><\/span><\/span><\/p> "]},"created":"1583248361","changed":"1583249723"},"3857":{"title":"Rothschild, Siegfried (Pinchas)","fields":{"field_biography":["<p><span><span><span>Siegfried (Pinchas) Rothschild was born on September 13, 1907 in Halberstadt, Germany and died on November 9, 2001 in Jerusalem, Israel. He was the son of Dr. Leopold Jehuda Rothschild. He studied at the universities of Würzburg and Frankfurt (‘Anstaltskunde’) to become a teacher and educator. Between 1933-1936, he worked as an educator in the Jewish children's home Ahawah in Berlin and the orphan's home Dinslaken. In 1937 he became head of Ahawah. In that year, he emigrated to Antwerpen, Belgium, where he led a children's home of the Jewish community.&nbsp; Siegfried was also a member of ESRA (Jewish orthodox youth union) and BJA (an orthodox union of Jewish academics).&nbsp; When the Nazis conquered Belgium in 1940, he became a civilian detainee and was imprisoned in France. His wife Rose Rothschild stayed in Belgium and saved a lot of children from death. After liberation, she went to Brussels and lead a home for orphans, who returned from KZ. Siegfried escaped around 1943. The organization OSE (Oeuvre de Secours aux enfants) asked him to lead a group of Jewish children to Switzerland. He agreed and stayed in Basel, where he again led a home for Jewish children. After the war, he went to Brussels and worked with his wife until 1948, when they went to the U.S. There, he worked as a teacher for Jewish subjects. In 1950, they immigrated to Palestine, where he led a children's home in Afula for 25 years.<\/span><\/span><\/span><\/p> "]},"created":"1583251628","changed":"1584101765"},"3884":{"title":"Franz Hainbach\/Heinebach (Perez Uriel)","fields":{"field_biography":["<p><span lang=\"EN-US\"><span><span>Franz Hainbach\/Heinebach (Perez Uriel) was born in Frankfurt\/Main and was a Zionist since World War I. He studied Agriculture in Berlin and worked in the children's home Ahawah as from 1926. He might have been a member of Lehmann's Jewish settlement (Jüdisches Volksheim). He innovated the pedagogical work at Ahawah by introducing the children's council. In 1929, he immigrated to Palestine, together with Hanni and Ernst Ullmann, first to Ben Shemen, then to Palestinian Ahawah. Later, he founded his own children's home, together with his second wife Mania. In the 1950's, he directed the Alyat Hanoar Camp in Ramat Hadassah. Until 1966, he headed Shorashim school. In 1961, he was awarded the President award for his activity in education.<\/span><\/span><\/span><\/p> "]},"created":"1584102700","changed":"1584106992"},"3896":{"title":"Rund, Ernst (Yaacov)","fields":{"field_biography":["<p><span><span><span>Ernst (Yaacov) Rund was born on January 1st,1902 in Germany and died on November 24,1980 in Israel. His father's name was Moshe. Ernst immigrated to Palestine in 1933 and worked in the welfare office for German Jews in Tel-Aviv (Histadruth Olej Germania, HOG).<\/span><\/span><\/span><\/p> "]},"created":"1584107729","changed":"1584108120"},"3900":{"title":"Hirsch, Siegfried (Shimon)","fields":{"field_biography":["<p><span><span><span>Siegfried (Shimon) Hirsch was born on December 14, 1905 in Hohensalza, Germany and died in 1979 in Rishon LeZion, Israel. Between 1921-1923 he completed a commercial apprenticeship (women's fashion) and worked there as an employee until 1928. In 1922, he also attended a weaving school and from 1924-1925 he studied at the business high school Berlin. Between 1929-1931, Hirsch attended the social political seminary of the University of Politics, Berlin, where he graduated as a social worker. He wrote his final project about decision-making (Willensbildung) and types of social communities as basics of social pedagogy (Prof. Carl Mennicke). From 1930-31 he studied music education at the youth music university (Prof. Jöde). He was also a leader in the Jewish youth movement (Kameraden) between 1921-1928, and did volunteer work with elderly between 1923-24. Hirsch did several internships as part of his training for social work: legal protection work at the welfare office Berlin-Kreuzberg, family welfare work at the welfare office Berlin-Prenzlauer Berg, where he also did youth counseling, and engaged in the areas of special education, guardianship, housing for apprentices, and youth movement. Furthermore, he was in charge of employment counseling and qualification tests at the employment office Berlin-Mitte, and worked in the youth-sanatorium of Dr. Jaemann in Nordhausen. From 1932-33 he attended a course at the institute for psychoanalysis Berlin. From 1931-32, he was employed as a social worker at the youth home Wolzig. In 1933, he headed the central Jewish youth home Berlin and worked as a social worker in the center for economic aid. He immigrated to Palestine in 1934.<\/span><\/span><\/span><\/p> <p><span><span><span>Hirsch applied for a job in social work in Tel Aviv, but has not been placed. Instead, he enlisted in the Haganah (Defense) in Beer Yaakov. In 1936, he settled down in Rishon LeZion. He became a manager of a pension fund in Tel Aviv and later worked for the Histadrut (General Organization of Workers in Israel). He was married to Lili Treiser and the couple had two sons.<\/span><\/span><\/span><\/p> "]},"created":"1584109295","changed":"1584371469"},"3944":{"title":"Brachiahu (Borochov), Dr. Mordechai","fields":{"field_biography":["<p><span><span><span>Dr. Mordechai Brachiahu (Borochov) was born in 1882 in Miezhagula (Mishagale) near Vilna, Lithuania and died on December 12,1959 in Jerusalem, Israel. He was the son of Rabbi Abba Ya'akov HaCohen Borochov, the owner of the Hevel Ya'akov, who served as a teacher at Yeshivat Merkaz HaRav. His brother was the author Aharon Michal Brachiahu. Mordechai studied medicine at Swiss universities (Bern, Basel and Zurich), where he was educated as a doctor of medicine in 1910, and later studied at the Moabit Hospital in Berlin. He immigrated to Eretz Israel in 1912, where he laid the foundation for introducing awareness of hygiene and preventive medicine. He worked as a doctor at the Hebrew Gymnasium Herzliya and replaced Dr. Sonia Belkind, who was the doctor of the students only. With the outbreak of the First World War, he volunteered for the Ottoman army and served there as a doctor until 1918. After that, he was a doctor in the Galilee settlements, near his home in Rosh Pina.<\/span><\/span><\/span><\/p> <p><span><span><span>In 1919, he moved to Jerusalem and founded a hygienic department for Hadassah (Medical Center). He was one of the developers of hygiene and preventive medicine, and developed the field of spiritual hygiene. Over the years, starting in 1929, he founded the first schools of their kind for children with mental retardation (conditions), as well as clinics for the treatment of children.<\/span><\/span><\/span><\/p> <p><span><span><span>He began his career in journalism before appearing in articles in the Hebrew newspaper HaMelitz, later on he wrote for various journals, such as Haaretz, Davar and others, as well as in the German press. Sometimes he signed under the names: M. Asia, M. Ben-Yaakov, M. Knights and more. Brachiahu has been the editor of the weekly \"Spiritual Hygiene\". In fact, from the first year of his stay in Israel, he began publishing books in the field of medicine and was the editor of \"La'am\", which was founded during the Second Aliyah and published scientific publications for the general public.<\/span><\/span><\/span><\/p> <p><span><span><span>In 1952, he retired from Hadassah, after 40 years of medical work in Israel. In 1953, he was awarded the Szold Prize for Medicine and Public Hygiene by the Tel Aviv Municipality for his pioneering work in schools and the integration of medicine in education in Israel.<\/span><\/span><\/span><\/p> <p><span><span><span>After his death his memoirs were printed, which he left in a manuscript. He left behind his wife Dr. Hanna Brachiahu and two daughters.<\/span><\/span><\/span><\/p> "]},"created":"1584371882","changed":"1584451280"}}}