{"person": {"2325": {"title": "Michaelis-Stern, Eva (born Stern)", "fields": {"field_biography": ["Eva Michaelis Stern (née Stern) was born in Breslau (Germany) on 29.12.1904 and died in 1992 in Jerusalem. She was the youngest of three children of Clara and William Stern, who was a professor of psychology and philosophy at the University of Breslau. In 1916, the family moved to Hamburg, where Professor Stern was appointed a professor of psychology and director of the Psychological Institute at the University of Hamburg. Eva’s brother, Günther, wrote under the pseudonym Anders, and was the husband of Hannah Arendt. The Stern family was steeped in German culture and far removed from Jewish life. After graduating from high school, Eva attended a two-year training program for gymnastics teachers. She then taught gymnastics in Hamburg and in Berlin, where many of her students were members of Zionist youth movements. Despite her parents’ objections, Eva became a Zionist and joined a Zionist youth movement. She was active in the Jewish settlement organization of Hamburg-Altona and visited Palestine for the first time in 1926. In 1928, she was invited to teach gymnastics at the Ben Shemen agricultural school in Palestine. Later, between 1928 and 1932, she worked at the Ahawah Jewish orphanage in Berlin. Eva co-founded and directed the Arbeitsgemeinschaft für Kinder und Jugendalijah, the fund-raising arm of the Youth Aliyah organization in Germany. From 1933 she worked in Nazi Germany under the eyes of the Gestapo, sending thousands of Jewish children to Palestine until she immigrated herself after an interrogation by Eichmann in 1938 together with her fiancé, Dolf (Adolf) Michaelis, a member of the Executive of the Zionist Federation of Germany. They were married in Jerusalem in March 1938. She moved immediately to London to head the Youth Aliyah office until 1945, where she helped hundreds of Jewish children escape from German-occupied countries and organized their passage to Palestine. Eva’s husband managed the Intria company, which had handled the transfer of funds from Germany to Palestine under a plan known as the Ha’avara agreement until the outbreak of World War II. After the war ended, Ilse and her husband returned to Palestine, where their son David was born. Eva served as the director of the International Relations Department of the Youth Aliyah organization in Jerusalem until 1952. After her retirement from Youth Aliyah, she founded the Hovevei Yerushalayim organization, which promoted civic improvement projects in the city of Jerusalem. In particular, it worked with youth from so-called “Oriental” families, or those who had come to Israel from Arab countries, in order to help make them good citizens. Ilse became active in AKIM, the National Association for the Habilitation of the Mentally Handicapped in Israel and in 1960 was appointed Chairwoman of its International Relations Department. She, together with Rahel Strauss, helped establish a sheltered workshop to provide employment for the mentally handicapped. She also worked together with Irene Gaster to found The Shield organization for mentally handicapped adults and later helped establish the Irene Gaster Hostel for mentally handicapped adults. In addition, she founded the Clara and William Stern Memorial Fund at the Hebrew University of Jerusalem to help train social workers to work with the handicapped. In 1980, she was honored by the Israel Ministry of Social Welfare for her accomplishments in the fields of saving children and aiding the handicapped. Eva Michaelis Stern was a frequent contributor to the German-language periodical Mitteilungsblatt published in Israel, and to other periodicals published in Israel and abroad. In 1989 she published a book entitled Emissaries in Wartime London, which included articles she had written for Mitteilungsblatt on youth aliyah during World War II as well as an essay by Dolf Michaelis on his work during the war. "]}, "created": "1541967081", "changed": "1547557105"}}}